Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_batchprocessimages.po
Languages: de, fr

source: <p><b>JPEG</b>: The Joint Photographic Experts Group's file format is a good Web file format but it uses lossy data compression.</p><p><b>PNG</b>: the Portable Network Graphics format is an extensible file format for the lossless, portable, well-compressed storage of raster images. PNG provides a patent-free replacement for GIF and can also replace many common uses of TIFF. PNG is designed to work well in online viewing applications, such as the World Wide Web, so it is fully streamable with a progressive display option. Also, PNG can store gamma and chromaticity data for improved color matching on heterogeneous platforms.</p>
de: <p><b>JPEG</b>: Das „Joint Photographic Experts Group“-Dateiformat ist ein gutes Webdateiformat, das verlustbehaftete Kompression nutzt.</p><p><b>PNG</b>: Das „Portable Network Graphics“-Format ist ein erweiterbares Dateiformat zum verlustfreien, portablen und komprimierten Speichern von Rasterbildern. PNG ermöglicht eine patentfreie Ersetzung des GIF-Formates und kann in vielen Fällen auch das TIFF-Format ersetzen. PNG wurde entworfen, um in Online-Bildbetrachtungsprogrammen, wie z. B. im World Wide Web, eingesetzt zu werden. Es kann optional eine Voransicht der Bilder während des Ladens anzeigen. Weiterhin kann PNG Gamma- und Farbwertdaten für eine verbesserte Bildanzeige in heterogenen Plattformen speichern.</p>
fr: <p><b>JPEG</b> : le format de fichier du JPEG (Joint Photographic Experts Group) est un bon format de fichier web mais il emploie une compression de données avec pertes.</p><p><b>PNG</b> : le format PNG (Portable Network Graphics) est un format de fichier extensible pour le stockage sans pertes, portable, bien comprimé des images ligne par ligne. PNG fournit un remplacement exempt de brevet pour GIF et peut également remplacer nombre d'utilisations courantes de TIFF. PNG étant conçu pour fonctionner parfaitement dans les applications d'affichage en ligne, telles que le World Wide Web, il est entièrement lisible en continu avec une option d'affichage progressif. De plus, PNG peut mémoriser des données de gamma et de chromaticité pour obtenir une correspondance de couleur améliorée sur les plates-formes hétérogènes.</p>

source: <p><b>TIFF</b>: the Tag Image File Format is a rather old standard that is still very popular today. It is a highly flexible and platform-independent format which is supported by numerous image processing applications and virtually all prepress software on the market.</p>
de: <p><b>TIFF</b>: das „Tagged Image File Format“ ist ein sehr alter Standard der heute immer noch sehr populär ist. Es ist ein sehr flexibles und plattformunabhängiges Format, das von vielen Bildbearbeitungsprogrammen und praktisch jeder Druckvorstufensoftware unterstützt wird.</p>
fr: <p><b>TIFF</b> : le format TIFF (Tag Image File Format) est un standard plutôt ancien, encore très apprécié aujourd'hui. Format extrêmement souple et indépendant de la plate-forme, il est pris en charge par de nombreuses applications de traitement de l'image et pratiquement tous les logiciels de prépresse présents sur le marché.</p>

source: <p><b>PPM</b>: the Portable Pixel Map file format is used as an intermediate format for storing color bitmap information. PPM files may be either binary or ASCII and store pixel values up to 24 bits in size. This format generates the largest-sized text files to encode images without losing quality.</p>
de: <p><b>PPM</b>: das „Portable Pixel Map“-Format wird als Zwischenformat zum Speichern von Farb-Bitmap-Informationen genutzt. PPM-Dateien sind entweder binär oder ASCII und speichern Pixelwerte bis zu einer Farbtiefe von 24 Bit. Dieses Format generiert die größten Textdateien, um Bilder verlustfrei zu kodieren.</p>
fr: <p><b>PPM</b> : le format PPM (Portable Pixel Map) est utilisé comme format intermédiaire pour mémoriser des informations sur l'image en couleurs. Les fichiers PPM peuvent être soit binaires soit ASCII et mémoriser des valeurs de pixels jusqu'à une taille de 24 bits. Ce format génère les fichiers texte de la taille la plus grande pour encoder des images sans perte de qualité</p>

source: <p><b>BMP</b>: the BitMaP file format is a popular image format from Win32 environment. It efficiently stores mapped or unmapped RGB graphics data with pixels 1-, 4-, 8-, or 24-bits in size. Data may be stored raw or compressed using a 4-bit or 8-bit RLE data compression algorithm. BMP is an excellent choice for a simple bitmap format which supports a wide range of RGB image data.</p>
de: <p><b>BMP</b>: das „BitMaP“-Format ist ein populäres Bildformat aus der Win32-Welt. Es speichert auf effiziente Weise gerichtete oder ungerichtete RGB-Grafikdaten mit Pixelgrößen von 1-, 4-, 8-, oder 24-Bit. Die Daten können roh oder mit einem 4- oder 8-Bit RLE-Kompressionsalgorithmus gepackt werden. BMP ist eine sehr gute Wahl für ein einfaches Bitmapformat, das eine sehr große Breite von RGB-Bilddaten unterstützt. </p>
fr: <p><b>BMP</b> : le format de fichier BMP (BitMaP) est un format d'image très répandu provenant de l'environnement Win32. Il mémorise efficacement les données graphiques RVB mappées ou non mappées avec des pixels d'une taille de 1, 4, 8 ou 24 bits. Les données peuvent être stockées brutes ou comprimées à l'aide d'un algorithme de compression de données RLE sur 4 ou 8 bits. BMP est un excellent choix pour un format bitmap simple qui prend en charge une vaste gamme de données d'images RVB.</p>

source: <p><b>TGA</b>: the TarGA image file format is one of the most widely used bitmap file formats for storage of 24 and 32 bits truecolor images. TGA supports colormaps, alpha channel, gamma value, postage stamp image, textual information, and developer-definable data.</p>
de: <p><b>TGA</b>: das „TarGA“-Format ist eines der am weitest verbreiteten Bitmap-Dateiformate zum Speichern von 24- und 32-Bit Echtfarben-Bildern. TGA unterstützt Farbtabellen, Alpha-Kanal, Gamma-Wert, Vorschaubilder, Textinformationen und Entwickler-definierte Daten.</p>
fr: <p><b>TGA</b> : le format de fichier d'image TarGA est un des formats de fichiers bitmap les plus largement utilisés pour le stockage d'images en couleurs vraies sur 24 et 32 bits. TGA prend en charge les cartes de couleurs, le canal alpha, la valeur de gamma, l'image en timbre-poste, les informations textuelles et les données pouvant être définies par un développeur.</p>

source: <p><b>EPS</b>: the Adobe Encapsulated PostScript image file format is a PostScript language program describing the appearance of a single page. Usually, the purpose of the EPS file is to be embedded inside another PostScript language page description.</p>
de: <p><b>EPS</b>: das Adobe „Encapsulated PostScript“-Format ist ein PostScript-Format, das eine einzelne Seite beschreibt. Normalerweise wird das EPS-Format daher benutzt, um diese Seite in einer anderen PostScript-Datei einzubinden.</p>
fr: <p><b>EPS</b> : le format de fichier image EPS ( Encapsulated PostScript) de Adobe est un programme pour le langage PostScript décrivant l'apparence d'une seule page. Habituellement, le but du fichier EPS est d'être intégré au sein de la description d'une page de langage PostScript.</p>

# image compression type
source: None
de: Keiner
fr: Aucun

source: Image File Format Options
de: Einstellungen zum Dateiformat
fr: Options de format de fichier image

source: Image compression level:
de: Bildkompressionsgrad:
fr: Niveau de compression d'image :

source: <p>The compression value for the target images:</p>
de: <p>Der Kompressionsgrad der Zielbilder:</p>
fr: <p>La valeur de compression des images cible :</p>

source: <p><b>1</b>: very high compression<br/><b>25</b>: high compression<br/><b>50</b>: medium compression<br/><b>75</b>: low compression (default value)<br/><b>100</b>: no compression</p>
de: <p><b>1</b>: sehr hohe Kompression<br/><b>25</b>: hohe Kompression<br/><b>50</b>: mittlere Kompression<br/><b>75</b>: niedrige Kompression (Voreinstellung)<br/><b>100</b>: keine Kompression</p>
fr: <p><b>1</b> : compression très élevée<br/><b>25</b> : compression élevée<br/><b>50</b> : compression moyenne<br/><b>75</b> : compression faible (valeur par défaut)<br/><b>100</b> : pas de compression</p>

source: Use lossless compression
de: Verlustfreie Kompression benutzen
fr: Utiliser une compression sans pertes

source: If this option is enabled, all JPEG operations will use lossless compression.
de: Wenn diese Einstellung aktiviert ist, werden alle JPEG-Operationen verlustfreie Kompression benutzen.
fr: Si cette option est cochée, toutes les opérations JPEG utiliseront une compression sans pertes.

source: Image compression algorithm:
de: Bildkompressionsalgorithmus:
fr: Algorithme de compression d'image :

# No TIFF compression
source: None
de: Keiner
fr: Aucun

source: Select here the compression algorithm.
de: Wählen Sie hier den Kompressionsalgorithmus.
fr: Sélectionnez ici l'algorithme de compression.

# No TGA compression
source: None
de: Keiner
fr: Aucun

source: Batch Image Effects
de: Stapel-Bildeffekte
fr: Effets des images en lots

source: Batch image effects
de: Stapel-Bildeffekte
fr: Effets des images en lots

source: A Kipi plugin for batch image-effect transformations. This plugin uses the "convert" program from the "ImageMagick" package.
de: Ein KIPI-Modul für Stapel-Bildeffekte. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour les transformations des effets des images en lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Image Effect Options
de: Bildeffekt-Einstellungen
fr: Options des effets des images

source: Effect:
de: Effekt:
fr: Effet :

# image effect
source: Adaptive Threshold
de: Adaptiver Schwellwert
fr: Seuil adaptatif

# image effect
source: Charcoal
de: Kohlezeichnung
fr: Fusain

# image effect
source: Detect Edges
de: Kanten finden
fr: Détection des bords

# image effect
source: Emboss
de: Relief
fr: Mise en relief

# image effect
source: Implode
de: Implodieren
fr: Implosion

# image effect
source: Paint
de: Gemälde
fr: Peinture

# image effect
source: Shade Light
fr: Teinte claire

# image effect
source: Solarize
de: Solarisation
fr: Solarisation

# image effect
source: Spread
fr: Dispersion

# image effect
source: Swirl
de: Wirbel
fr: Tourbillon

# image effect
source: Wave
de: Wellen
fr: Onde

source: <p>Select here the effect type for your images:</p><p><b>Adaptive threshold</b>: perform local adaptive thresholding. The algorithm selects an individual threshold for each pixel based on the range of intensity values in its local neighborhood. This allows for thresholding of an image whose global intensity histogram does not contain distinctive peaks.<br/><b>Charcoal</b>: simulate a charcoal drawing.<br/><b>Detect edges</b>: detect edges within an image.<br/><b>Emboss</b>: returns a grayscale image with a three-dimensional effect. The algorithm convolves the image with a Gaussian operator of the given radius and standard deviation.<br/><b>Implode</b>: implode image pixels about the center.<br/><b>Paint</b>: applies a special effect filter that simulates an oil painting.<br/><b>Shade light</b>: shines a distant light on an image to create a three-dimensional effect.<br/><b>Solarize</b>: negate all pixels above the threshold level. This algorithm produces a solarization effect seen when exposing a photographic film to light during the development process.<br/><b>Spread</b>: this is a special-effect method that randomly displaces each pixel in a block defined by the radius parameter.<br/><b>Swirl</b>: swirls the pixels about the center of the image. <br/><b>Wave</b>: creates a "ripple" effect in the image by shifting the pixels vertically along a sine wave.</p>
de: <p>Wählen Sie hier den Effekt-Typ für Ihr Bild:</p><p><b>Adaptiver Schwellwert</b>: Arbeitet einen lokalen Adaptiver Schwellwert ein. Der Algorithmus wählt einen individuellen Schwellwert für jedes Pixel basierend auf den Bereich der Intensitätswerte der angrenzenden Pixel. Dies erlaubt die Grenzwertsetzung für ein Bild, dessen globales Intensitätshistogramm keine herausragenden Spitzen hat.<br/><b>Kohle</b>: Simuliert eine Kohlezeichnung.<br/><b>Kanten finden</b>: Findet die Kanten in einem Bild.<br/><b>Prägen</b>: Erzeugt ein Graustufenbild mit einem dreidimensionalen Effekt. Der Algorithmus rollt das Bild mit einem gaußschen Operator mit gegebenem Radius und Standardvarianz zusammen.<br/><b>Implodieren</b>: Implodiert die Bildpixel um den Mittenbereich.<br/><b>Malen</b>: Wendet einen speziellen Filter an, der ein Ölgemälde simuliert.<br/><b>Schatten/Licht</b>: Beleuchtet das Bild mit einem entfernten Licht, um einen dreidimensionalen Effekt zu erzeugen.<br/><b>Solarisation</b>: Negiert alle Pixel über einem Grenzwert. Dieser Algorithmus erzeugt einen Solarisationseffekt den man beobachten kann, wenn eine Fotofilm während der Entwicklung Licht ausgesetzt wird.<br/><b>Streuung</b>: Dieser Effekt ersetzt zufällig jeden Pixel in einem durch den Radius definierten Block.<br/><b>Wirbel</b>: Wirbelt die Pixel um die Mitte des Bildes.<br/><b>Wellen</b>: Durch vertikale Verschiebung der Pixel entlang einer Sinuskurve wird im Bild ein Wellen-Effekt erzeugt.</p>
fr: <p>Choisissez ici le type d'effets de vos images :</p><p><b>Seuil adaptatif</b> : effectue un seuil adaptatif local. L'algorithme sélectionne un seuil individuel pour chaque pixel en fonction de la plage des valeurs d'intensité présentes dans son voisinage immédiat. Ce comportement prévoit le seuillage d'une image dont l'histogramme d'intensité ne contient pas de pics distinctifs.<br/><b>Fusain</b> : simule un dessin au fusain.<br/><b>Détection des bords</b> : détecte les bords à l'intérieur d'une image.<br/><b>Mise en relief</b> : retourne une image en niveaux de gris avec un effet tridimensionnel. L'algorithme convolue l'image avec un opérateur gaussien du rayon donné et un écart-type.<br/><b>Implosion</b> : implose les pixels des images autour du centre.<br/><b>Peinture</b> : applique un effet spécial qui simule la peinture à l'huile.<br/><b>Teinte claire</b> : fait briller une lumière distante sur une image pour créer un effet tridimensionnel.<br/><b>Solarisation</b> : inverse tous les pixels au-dessus du niveau de seuil. Cet algorithme produit un effet de solarisation perceptible lorsqu'on expose un film photographique à la lumière pendant le processus de développement.<br/><b>Dispersion</b> : méthode d'effets spéciaux qui déplace chaque pixel dans un bloc défini par le paramètre de rayon.<br/><b>Tourbillon</b> : fait tourbillonner les pixels autour du centre de l'image. <br/><b>Onde</b> : crée un effet de « cascade » dans l'image en décalant les pixels verticalement le long d'une onde sinusoïdale.</p>

source: Effect Options
de: Effekt-Einstellungen
fr: Options des effets

source: Width:
de: Breite:
fr: Largeur :

source: Select here the value which represents the width of the local neighborhood.
de: Wählen Sie hier den Wert, der die Breite der direkten Nachbarschaft repräsentiert.
fr: Choisissez ici la valeur représentant la largeur du voisinage local.

source: Height:
de: Höhe:
fr: Hauteur :

source: Select here the value which represents the height of the local neighborhood.
de: Wählen Sie hier den Wert, der die Höhe der direkten Nachbarschaft repräsentiert.
fr: Choisissez ici la valeur représentant la hauteur du voisinage local.

source: Offset:
de: Abstand:
fr: Décalage :

source: Select here the value which represents the mean offset.
de: Wählen Sie hier den Wert, der den mittleren Abstand repräsentiert.
fr: Choisissez ici la valeur représentant le décalage moyen.

source: Radius:
fr: Rayon :

source: Select here the value which represents the radius of the pixel neighborhood.
de: Wählen Sie hier den Wert, der den Radius der Pixel für die Nachbarschaft repräsentiert.
fr: Choisissez ici la valeur représentant le rayon du voisinage des pixels.

source: Deviation:
de: Varianz:
fr: Écart :

source: Select here the value which represents the standard deviation of the Gaussian, in pixels.
de: Wählen Sie hier die die Standardvarianz des gaußschen Algorithmus in Pixeln.
fr: Choisissez ici la valeur représentant l'écart-type du gaussien, en pixels.

source: Select here the value which represents the radius of the pixel neighborhood. Radius defines the radius of the convolution filter. If you use a radius of 0 the algorithm selects a suitable radius.
de: Wählen Sie hier den Radius der Pixel-Nachbarschaft. Der Radius wird für einen Wellenfilter genutzt. Benutzen Sie einen Radius von 0, wenn der Algorithmus selbst einen passenden Radius wählen soll.
fr: Choisissez ici la valeur représentant le rayon du voisinage des pixels. Le rayon définit le rayon du filtre de convolution. Si vous utilisez un rayon de 0, l'algorithme sélectionne un rayon approprié.

source: Select here the value which represents the radius of the pixel neighborhood. For reasonable results, radius should be larger than deviation. If you use a radius of 0 the algorithm selects a suitable radius.
de: Wählen Sie hier den Radius der Pixel-Nachbarschaft. Für ein brauchbares Ergebnis sollte der Radius größer sein als die Varianz. Benutzen Sie einen Radius von 0, wenn der Algorithmus selbst einen passenden Radius wählen soll.
fr: Sélectionnez ici la valeur représentant le rayon du voisinage des pixels. Pour obtenir des résultats raisonnables, le rayon devra âtre supérieur à l'écart. Si vous utilisez un rayon de 0, l'algorithme sélectionne un rayon approprié.

source: Factor:
de: Faktor:
fr: Facteur :

source: Select here the value which represents the extent of the implosion.
de: Wählen Sie hier den Wert, der die Ausdehnung der Implosion angibt.
fr: Choisissez ici la valeur représentant l'étendue de l'implosion.

source: Select here the value which represents the radius of the circular neighborhood. Each pixel is replaced by the most frequent color occurring in a circular region defined by the radius.
de: Wählen Sie hier den Radius der kreisförmigen Nachbarschaft. Jedes Pixel wird durch die am häufigsten auftretende Farbe in dem durch den Radius definierten Kreis ersetzt.
fr: Choisissez ici la valeur représentant le rayon du voisinage circulaire. Chaque pixel est remplacé par la couleur qui apparaît le plus fréquemment dans la région circulaire définie par le rayon.

source: Azimuth:
de: Drehwinkel:
fr: Azimut :

source: Select here the value which represents the azimuth of the light source direction. The azimuth is measured in degrees above the x axis.
de: Wählen Sie hier den Drehwinkel der Richtung, aus der die Lichtquelle scheint. Der Drehwinkel wird in Grad von der X-Achse gemessen.
fr: Choisissez ici la valeur représentant l'azimut de la direction de la source de lumière. L'azimut est mesuré en degrés au-dessus de l'axe x.

source: Elevation:
de: Höhenwinkel:
fr: Élévation :

source: Select here the value which represents the elevation of the light source direction. The elevation is measured in pixels above the Z axis.
de: Wählen Sie hier den Höhenwinkel zur Lichtquelle. Der Höhenwinkel wird in Pixel über der Z-Achse gemessen.
fr: Choisissez ici la valeur représentant l'élévation de la direction de la source de lumière. L'élévation est mesurée en pixels au-dessus de l'axe Z.

source: Select here the value which represents the percent-threshold of the solarize intensity.
de: Wählen Sie hier den prozentualen Grenzwert der Solarisierungsintensität.
fr: Choisissez ici la valeur représentant le seuil de pourcentage d'intensité de solarisation.

source: Select here the value which represents the random pixel in a neighborhood of this extent.
de: Wählen Sie hier den Radius der Nachbarschaft, aus dem der zufällige Pixel genommen wird.
fr: Choisissez ici la valeur représentant le pixel aléatoire dans un voisinage de cette étendue.

source: Degrees:
de: Grad:
fr: Degrés :

source: Select here the value which represents the tightness of the swirling effect. You get a more dramatic effect as the degrees move from 1 to 360.
de: Wählen Sie hier die Dichte des Wirbeleffekts. Sie erhalten einen dramatischeren Effekt je höher Sie den Wert zwischen 1 und 360 Grad wählen.
fr: Choisissez ici la valeur représentant l'épaisseur de l'effet de tourbillon. Vous obtiendrez un effet plus spectaculaire au fur et à mesure que les degrés vont de 1 à 360.

source: Select here the value which represents the amplitude of the sine wave.
de: Wählen Sie hier den Ausschlag der Sinuskurve.
fr: Choisissez ici la valeur représentant l'amplitude de l'onde sinusoïdale.

source: Length:
de: Länge:
fr: Longueur :

source: Select here the value which represents the wave length of the sine wave.
de: Wählen Sie hier die Wellenlänge der Sinuskurve.
fr: Choisissez ici la valeur représentant la longueur d'onde de l'onde sinusoïdale.

source: Batch Image Filtering
de: Stapel-Bildfilterung
fr: Filtrage des images en lots

source: Batch image filtering
de: Stapel-Bildfilterung
fr: Filtrage des images en lots

source: A Kipi plugin to batch filter images. This plugin uses the "convert" program from the "ImageMagick" package.
de: Ein KIPI-Modul zur Stapel-Bildfilterung. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour le filtrage d'images en lots. Ce module externe utilise le programme « convert » provenant du paquetage « ImageMagick ».

source: Image Filtering Options
de: Bildfilter-Einstellungen
fr: Options de filtrage des images

# image filter
source: Add Noise
de: Rauschen hinzufügen
fr: Ajout de bruit

# image filter
source: Antialias
de: Kantenglättung
fr: Anti-crénelage

# image filter
source: Blur
de: Weichzeichnen
fr: Flou

# image filter
source: Despeckle
de: Flecken entfernen
fr: Dé-chatoiement

# image filter
source: Enhance
de: Verbessern
fr: Rehaussement

# image filter
source: Median
de: Mittelwert
fr: Médian

# image filter
source: Noise Reduction
de: Rauschen reduzieren
fr: Réduction de bruit

# image filter
source: Sharpen
de: Scharfzeichnen
fr: Piqué

# image filter
source: Unsharp
de: Unscharfmaskierung
fr: Accentuation
