Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_timeadjust.po
Languages: fr, th

source: Determine time difference with clock photo
fr: Déterminer la différence de temps avec une photo d'horloge
th: กำหนดความแตกต่างของเวลาด้วยนาฬิกาจากรูปภาพ

source: Load different photo
fr: Charger une photographique différente
th: โหลดภาพที่แตกต่าง

source: If you have a photo in your set with a clock or another external time source on it, you can load it here and set the indicator to the (date and) time displayed. The difference of your internal camera clock will be determined from this setting.
fr: Si vous avez une photo dans votre liste avec une horloge ou une autre source de temps externe, vous pouvez le charger ici et mettre l'indicateur (à la date et) à l'heure affichée. La différence de votre horloge interne de l'appareil photographique sera déterminéà partir de ce paramètre.
th: หากคุณมีรูปภาพในชุดรูปภาพของคุณ ที่มีนาฬิกาหรือแหล่งเวลาภายนอกในภาพ คุณสามารถจะทำการโหลดมันได้ที่นี่ แล้วทำการตั้งค่าตัวบ่งชี้ถึง (วันและ) เวลาที่จะแสดงได้ ความแตกต่างกับนาฬิกาภายในกล้องของคุณจะถูกพิจารณาจากการตั้งค่าในส่วนนี้

source: Scale:
fr: Échelle :
th: ระดับการย่อขยาย:

source: The clock date and time:
fr: La date et l'heure de l'horloge :
th: วันและเวลาของนาฬิกา:

source: <font color="red"><b>Could not obtain date and time information from image %1.</b></font>
fr: <font color="red"><b>Impossible d'obtenir les informations de date et d'heure à partir de l'image %1.</b></font>
th: <font color="red"><b>ไม่สามารถรับค่าข้อมูลวันและเวลาจากภาพ %1 ได้</b></font>

source: <font color="red"><b>Could not load image %1.</b></font>
fr: <font color="red"><b>Impossible de charger l'image %1.</b></font>
th: <font color="red"><b>ไม่สามารถโหลดภาพ %1 ได้</b></font>

source: Adjust Time && Date...
fr: Changer l'heure et la date...
th: ปรับวันที่และเ&วลาของภาพ...

source: Adjust Time & Date
fr: Changer l'heure et la date
th: ปรับวันที่และเวลาของภาพ

source: Time Adjust
fr: Changer l'heure
th: ปรับเวลาของภาพ

source: A Kipi plugin for adjusting the timestamp of picture files
fr: Un module externe Kipi pour modifier l'horodatage des fichiers images
th: ส่วนเสริมของ Kipi สำหรับปรับวันที่และเวลาของแฟ้มภาพต่าง ๆ

source: (c) 2003-2005, Jesper K. Pedersen (c) 2006-2009, Gilles Caulier
th: สงวนลิขสิทธิ์ (c) 2003-2005, Jesper K. Pedersen สงวนลิขสิทธิ์ (c) 2006-2009, Gilles Caulier

source: Author
fr: Auteur
th: ผู้เขียน

source: Developer and maintainer
fr: Développeur et mainteneur
th: ผู้พัฒนาและดูแลโครงการ

source: Handbook
fr: Manuel
th: คู่มือการใช้งาน

source: Use Time && Date
fr: Utiliser l'heure et la date
th: ใช้วันที่และเวลา

source: %1 timestamp
fr: %1 l'horodatage
th: เวลากำกับภาพของ %1

source: File last modified
fr: Dernier fichier modifié
th: แฟ้มถูกแก้ไขล่าสุดเมื่อ

source: EXIF: created
fr: EXIF : créé
th: EXIF: สร้างเมื่อ

source: EXIF: original
th: EXIF: ต้นฉบับ

source: EXIF: digitized
fr: EXIF : numérisé
th: EXIF: แปลงทางดิจิทัลเมื่อ

source: IPTC: created
fr: IPTC : créé
th: IPTC: สร้างเมื่อ

source: XMP: created
fr: XMP : créé
th: XMP: สร้างเมื่อ

source: Reset to current date
fr: Réinitialiser la date actuelle
th: ตั้งค่าให้เป็นวันที่ปัจจุบัน

source: Adjust
fr: Changer
th: ปรับเวลาของภาพ

source: Copy value
fr: Copier la valeur
th: คัดลอกค่า

source: Add
fr: Ajouter
th: เพิ่ม

source: Subtract
fr: Soustraire
th: ลด

# time adjust offset, days value label
source: days
fr: Jours
th: วัน

source: Determine from clock photo
fr: Détermine depuis l'horloge de la photographie
th: กำหนดจากนาฬิกาของรูปภาพ

source: Update Time && Date
fr: Mettre à jour l'heure et la date
th: ปรับแก้วันที่และเว&ลาของภาพ

source: XMP
th: ข้อมูล XMP

source: Example
fr: Exemple
th: ตัวอย่าง

source: 1 image will be changed
fr: 1 image sera modifiée
th: จะมีการเปลี่ยนแปลงภาพ %1 ภาพ

source: 1 image will be changed;
fr: 1 image sera modifiée ;
th: จะมีการเปลี่ยนแปลงภาพ %1 ภาพ;

source: 1 image will be skipped due to an inexact date.
fr: 1 image sera ignorée à cause d'une date inexacte
th: จะมีการข้าม %1 ภาพ เนื่องจากวันที่คลาดเคลื่อน

source: 1 image will be skipped due to a missing source timestamp.
fr: 1 image sera ignorée en raison d'un horodatage source manquant.
th: จะมีการข้าม %1 ภาพ เนื่องจากไม่พบส่วนวันที่ในต้นฉบับ

source: Custom: <b>%1</b>
fr: Personnalisé : <b>%1</b>
th: กำหนดเอง: <b>%1</b>

source: Original: <b>N/A</b><br/>Image will be skipped
fr: Original : <b>n/d</b><br/>L'image sera ignorée
th: ภาพต้นฉบับ: <b>ไม่มีข้อมูล</b><br/>ภาพ จะถูกข้าม

source: Original: <b>%1</b>
th: ภาพต้นฉบับ: <b>%1</b> ภาพ

source: Original: <b>%1</b><br/>Adjusted: <b>%2</b>
fr: Original : <b>%1</b><br/>Ajusté : <b>%2</b>
th: ภาพต้นฉบับ: <b>%1</b> ภาพ<br/>ถูกปรับแก้ไป: <b>%2</b> ภาพ

source: Unable to update metadata in:
fr: Impossible de mettre à jour les méta-données dans :
th: ไม่สามารถปรับปรุงข้อมูลกำกับภาพได้ใน:

source: Unable to update file modification time in:
fr: Impossible de mettre à jour la date de modification du fichier dans
th: ไม่สามารถปรับปรุงเวลาที่มีการแก้ไขของแฟ้มได้ใน:

# NAME OF TRANSLATORS
source: Your names
fr: Cyrille Bieuzent
th: ถนอมทรัพย์ นพบูรณ์

# EMAIL OF TRANSLATORS
source: Your emails
fr: bieuzent@gmail.com
th: donga.nb@gmail.com
