Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_wallpaper.po
Languages: de, eo, eu, fi, fr, hu, is, pt, sk, tr, zh_tw

source: &Set as Background
de: Als Hintergrundbild &verwenden
eo: Agordi kiel fono
eu: &Ezarri atzeko plano gisa
fi: &Aseta taustakuvaksi
fr: &Mettre en arrière-plan
hu: &Beállítás háttérként
is: &Setja sem bakgrunnsmynd
pt: E&scolher como Fundo
sk: Na&staviť ako pozadie
tr: &Arkaplan olarak Ayarla
zh_tw: 設定為背景(&S)

source: Centered
de: Zentriert
eo: Centre
eu: Zentratua
fi: Keskitetty
fr: Centrer
hu: Középre
is: Miðjað
pt: Centrado
sk: Vystrediť
tr: Ortalanmış
zh_tw: 置中

source: Centered Tiled
de: Zentriert gekachelt
eo: Centrigitaj tegoloj
eu: Zentratuta lauza moduan
fi: Keskitetty monistus
fr: Centrer Juxtaposer
hu: Középre mozaikszerűen
is: Flísalagt frá miðju
pt: Mosaico Centrado
sk: Vystredene dlaždicovať
tr: Ortalı Döşenmiş
zh_tw: 置中鋪排

source: Centered Max-Aspect
de: Zentrierte Maximalausdehnung
eo: Centrigita Maks-aspekto
eu: Zentratua gehienezko aspektu-erlazioarekin
fi: Keskitetty, maksimi kuvasuhde
fr: Centrer taille réelle
hu: Középre teljes méretben
is: Miðjað-Mesta stærð
pt: Centrado Aspecto Máximo
sk: Vystredene dlaždicovať
tr: Maksimum Oranda Ortalanmış
zh_tw: 置中的最大外觀

source: Tiled Max-Aspect
de: Gekachelte Maximalausdehnung
eo: Tegolita Maks-aspekto
eu: Lauza moduan gehienezko aspektu-erlazioarekin
fi: Monistettu, maksimi kuvasuhde
fr: Juxtaposé taille réelle
hu: Mozaikszerűen teljes méretben
is: Flísalagt-Mesta stærð
pt: Mosaico Aspecto Máximo
sk: Vystredene dlaždicovať
tr: Maksimum Oranda Döşenmiş
zh_tw: 鋪排的最大外觀

source: Scaled
de: Skaliert
eo: Etendite
eu: Eskalatua
fi: Skaalattu
fr: Redimensionner
hu: Méretezett
is: Teygt
pt: Escalado
sk: Škálovať
tr: Ölçeklenmiş
zh_tw: 縮放

source: Centered Auto Fit
de: Zentriert mit autom. Anpassung
eo: Centre aŭtomate adaptita
eu: Zentratua doitze-automatikoarekin
fi: Keskitetty automaattisovitus
fr: Centrer ajustement automatique
hu: Automatikus igazítás középre
is: Miðjað-Aðlagað
pt: Centrado Auto Encaixe
sk: Vystredene dlaždicovať
tr: Ortalanmış (Otomatik Sığdır)
zh_tw: 置中並自動填滿

source: Scale && Crop
de: Skalieren und zuschneiden
eo: Skali && Stuci
eu: Eskalatu eta moztu
fi: Skaalaa ja rajaa
fr: Redimensionner et rogner
hu: Méretezés és levágás
is: Teygja && sníða af
pt: Escalado e Cortado
sk: Škálovať a odrezať
tr: Ölçekle && Kırp
zh_tw: 縮放並裁剪

source: <p>You selected a remote image. It needs to be saved to your local disk to be used as a wallpaper.</p><p>You will now be asked where to save the image.</p>
de: <p>Sie haben ein Bild auf einer nicht lokalen Festplatte ausgewählt. Es muss lokal gespeichert werden, bevor es als Hintergrundbild benutzt werden kann.</p><p>Sie werden nun gefragt, wo Sie das Bild speichern möchten.</p>
eo: <p>Vi elektis foran bildon. Vi bezonas konservi ĝin loke por uzi ĝin kiel tapeto.</p><p>Vi nun elektu kie konservi ĝin.</p>
eu: <p>Urruneko irudi bat hautatu duzu. Lokaleko disko gogorrean gorde behar duzu horma-paper gisa erabili ahal izateko.</p><p>Orain, irudia non gordetzea nahi duzun galdetuko zaizu.</p>
fi: <p>Valitsit etäkohteessa sijaitsevan kuvan, joka täytyy tallentaa paikalliselle levylle ennen käyttöä.</p><p>Valitse kansio, johon haluat tallettaa kuvan.</p>
fr: <p>Vous avez choisi une image distante. Elle doit être enregistrer sur le disque local afin d'être utilisée comme papier peint </p><p>Où voulez-vous enregistrer cette image ? </p>
hu: <p>Egy távoli képet választott ki. A helyi lemezre kell mentenie hogy használhassa háttérképként.</p><p>A program fel fogja szólítani a mentés helyénel megadására. </p>
is: <p>Þú valdir mynd á fjarlægri vél. Það þarf að vista hana á harðan disk í tölvunni þinni til að hægt sé að nota hana sem bakgrunn.</p><p>Þú verður núna spurð(ur) hvar þú viljir vista myndina.</p>
pt: <p>Escolheu uma imagem remota. Esta precisa de ser gravada no seu disco local para ser utilizada como papel de parede.</p><p>Vai-lhe ser perguntado onde gravar a imagem.</p>
sk: <p>Vybrali ste si vzdialený obrázok. Najprv ho musíte uložiť na lokálny disk, aby sa dal použiť ako pozadie.</p><p>Teraz zadajte miesto kam sa má obrázok uložiť.</p>
tr: <p>Bir uzak görüntü seçtiniz. Görüntünün arkaplan yapılabilmesi için yerel diskinize kaydedilmesi gerekiyor.</p><p>Şimdi dosyanın nereye kaydedileceği sorulacak.</p>
zh_tw: <p>您選擇了一張遠端影像。用來作為桌布需要儲存至您的本機磁碟。</p><p>將會詢問您影像的儲存位置。</p>

source: Change Background
de: Hintergrund ändern
eo: Ŝanĝi fonon
eu: Aldatu atzeko planoa
fi: Vaihda taustakuva
fr: Changer la papier peint
hu: Háttér megváltoztatása
is: Breyta bakgrunni
pt: Mudar o Fundo
sk: Zmeniť pozadie
tr: Arkaplanı Değiştir
zh_tw: 變更背景

source: Background cannot be changed.
de: Der Hintergrund kann nicht geändert werden.
eo: Ne eblas ŝanĝi fonon.
eu: Atzeko planoa ezin da aldatu.
fi: Taustakuvaa ei voi vaihtaa.
fr: L'arrière-plan ne peut-être modifié.
hu: A háttér nem változtatható meg.
is: Ekki er hægt að skipta um bakgrunnsmynd.
pt: O fundo não pode ser alterado.
sk: Pozadie sa nedá zmeniť.
tr: Arkaplan değiştirilemez.
zh_tw: 背景無法變更。
