Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_yandexfotki.po
Languages: el, eo

source: &Export
el: &Εξαγωγή
eo: &Eksporti

source: Main Toolbar
el: Κύρια γραμμή εργαλείων
eo: Ĉefa ilobreto

source: Export to &Yandex.Fotki...
el: Εξαγωγή στο &Yandex.Fotki...
eo: Eksporti al &Yandex.Fotki...

source: Password for the album (optional).
el: Κωδικός για το λεύκωμα (προαιρετικό).
eo: Pasvorto por la albumo (laŭvola).

source: Password:
el: Κωδικός:
eo: Pasvorto:

source: Error
el: Σφάλμα
eo: Eraro

source: Title cannot be empty.
el: Ο τίτλος δεν μπορεί να είναι κενός.
eo: Titolo ne povas esti malplena.

source: Update policy:
el: Ενημέρωση πολιτικής:
eo: Ĝisdatigi politikon:

source: Update metadata
el: Ενημέρωση μεταδεδομένων
eo: Ĝisdatigi metadatenojn

source: Update metadata of remote file and merge remote tags with local
el: Ενημέρωση μεταδεδομένων απομακρυσμένου αρχείου και συγχώνευση απομακρυσμένων ετικετών με τοπικές
eo: Ĝisdatigi metadatenojn de fora dosiero kaj kunfandi forajn etikedojn kun lokaj

source: Skip photo
el: Παράλειψη φωτογραφίας
eo: Preterpasi foton

source: Simple skip photo
el: Απλή παράλειψη φωτογραφίας
eo: Simpla salti foton

source: Upload as new
el: Αποστολή ως νέας
eo: Alŝuti kiel nova

source: Add photo as new
el: Προσθήκη φωτογραφίας ως νέας
eo: Aldoni foton kiel nova

source: Privacy settings:
el: Ρυθμίσεις ιδιωτικότητας:
eo: Privateca agordo:

source: Public access
el: Δημόσια πρόσβαση
eo: Publika aliro

source: Friends access
el: Πρόσβαση φίλων
eo: Aliro de amikoj

source: Private access
el: Ιδιωτική πρόσβαση
eo: Privata aliro

source: Hide original photo
el: Απόκρυψη αρχικής φωτογραφίας
eo: Kaŝi originan foton

source: Disable comments
el: Απενεργοποίηση σχολίων
eo: Malebligi komentojn

source: Adult content
el: Περιεχόμενο για ενήλικες
eo: Plenkreska enhavo

source: Yandex.Fotki Plugin
el: Πρόσθετο Yandex.Fotki
eo: Yandex.Fotki Kromaĵo

source: A tool to export image collections to Yandex.Fotki web service.
el: Ένα εργαλείο εξαγωγής συλλογών από εικόνες στην υπηρεσία ιστού Yandex.Fotki .
eo: Ilo por eksporti bildkolektojn al Yandex.Fotki-retservo.

source: Author
el: Συγγραφέας
eo: Aŭtoro

source: Unauthorized
el: Χωρίς εξουσιοδότηση
eo: Neaŭtorizita

source: Processing Failed
el: Αποτυχία επεξεργασίας
eo: Traktado Malsukcesis

source: Failed to prepare image %1 Do you want to continue?
el: Αποτυχία προετοιμασίας της εικόνας %1 Θέλετε να συνεχίσετε;

source: Images have been uploaded
el: Οι εικόνες έχουν αποσταλεί
eo: Bildoj estas alŝutitaj

source: Please select album first
el: Παρακαλώ επιλέξτε λεύκωμα πρώτα
eo: Bonvolu unue elekti albumon

source: Session error
el: Σφάλμα συνεδρίας
eo: Seanca eraro

source: Token error
el: Σφάλμα αναγνωριστικού
eo: Ĵetoneraro

source: Invalid credentials
el: Μη έγκυρα στοιχεία εισόδου
eo: Nevalidaj akreditaĵoj

source: Cannot get service document
el: Αδυναμία ανάκτησης εγγράφου υπηρεσίας
eo: Ne povas ricevi servodokumenton

source: Cannot list albums
el: Αδυναμία καταγραφής λευκωμάτων
eo: Ne povas listigi albumojn

source: Cannot list photos
el: Αδυναμία καταγραφής εικόνων
eo: Ne povas listigi fotojn

source: Cannot update album info
el: Αδυναμία ενημέρωσης πληροφοριών λευκώματος
eo: Ne povas ĝisdatigi albumajn informojn

source: Uploading Failed
el: Αποτυχία αποστολής
eo: Malsukcesa alŝuto

source: Failed to upload image %1 Do you want to continue?
el: Αδυναμία αποστολής της εικόνας %1 Θέλετε να συνεχίσετε;

source: Unknown error
el: Άγνωστο σφάλμα
eo: Nekonata eraro

source: Roman Tsisyk
eo: Roman Cisyk
