Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_batchprocessimages.po
Languages: de, fr

source: <p>Select here the filter type for your images:</p><p><b>Add noise</b>: add artificial noise to an image.<br/><b>Antialias</b>: remove pixel aliasing.<br/><b>Blur</b>: blur the image with a Gaussian operator.<br/><b>Despeckle</b>: reduces the speckle noise in an image while preserving the edges of the original image.<br/><b>Enhance</b>: apply a digital filter to enhance a noisy image.<br/><b>Median</b>: apply a median filter to an image.<br/><b>Noise reduction</b>: reduce noise in an image. <br/><b>Sharpen</b>: sharpen the image with a Gaussian operator.<br/><b>Unsharp</b>: sharpen the image with an unsharp mask operator.</p>
de: <p>Wählen Sie hier den Filtertyp für Ihre Bilder:</p><p><b>Rauschen hinzufügen</b>: Fügt dem Bild Rauschen hinzu.<br/><b>Kantenglättung</b>: Glättet harte Kanten.<br/><b>Weichzeichnen</b>: Zeichnet das Bild mit einem gaußschen Filter weich.<br/><b>Flecken entfernen</b>: Verringert die Flecken in einem Bild.<br/><b>Verbessern</b>: Wendet einen Digital-Filter zur Verbesserung eines verrauschten Bildes an.<br/><b>Mittelwert</b>: Wendet einen Mittelwert-Filter auf das Bild an. <br/><b>Rauschen reduzieren</b>: Reduziert das Rauschen eines Bildes.<br/><b>Schärfen</b>: Schärft das Bild mit einem gaußschen Filter.<br/><b>Unscharfmaskierung</b>: Schärft das Bild mit einer Unscharfmaske.</p>
fr: <p>Choisissez ici le type de filtre de vos images :</p><p><b>Ajout de bruit</b> : ajoute du bruit artificiel à une image.<br/><b>Anticrénelage</b> : supprime le crénelage des pixels.<br/><b>Flou</b> : estompe l'image avec un opérateur gaussien.<br/><b>Dé-chatoiement</b> : réduit le bruit de chatoiement dans une image tout en préservant les bords de l'image originale.<br/><b>Rehaussement</b> : applique un filtre numérique pour améliorer une image bruyante.<br/><b>Médian</b> : applique un filtre médian à une image.<br/><b>Réduction de bruit</b> : réduit le bruit dans une image. <br/><b>Définition des contours</b> : définit les contours de l'image avec un opérateur gaussien.<br/><b>Netteté</b> : définit les contours de l'image avec un opérateur de renforcement de la netteté.</p>

# image noise type
source: Gaussian
de: Gaußsch
fr: Gaussien

# image noise type
source: Uniform
de: Gleichförmig
fr: Uniforme

# image noise type
source: Multiplicative
de: Multiplikativ
fr: Multiplicatif

# image noise type
source: Impulse
de: Impuls
fr: Impulsion

# image noise type
source: Laplacian
de: Laplace
fr: Laplacien

source: Filter Options
de: Filtereinstellungen
fr: Options de filtre

source: Select here the algorithm method which will used to add random noise to the images.
de: Wählen Sie hier den Algorithmus, der benutzt wird, um Zufallsrauschen zu den Bildern hinzuzufügen.
fr: Choisissez ici la méthode d'algorithme qui sera utilisée pour ajouter du bruit aléatoire aux images.

source: Noise algorithm:
de: Rauschalgorithmus:
fr: Algorithme de bruit :

source: Select here the blur radius of the Gaussian, not counting the center pixel. For reasonable results, the radius should be larger than deviation. If you use a radius of 0 the blur operation selects a suitable radius.
de: Wählen Sie hier den Radius des gaußschen Weichzeichners. Der Pixel in der Mitte wird dabei nicht mitgezählt. Für ein brauchbares Ergebnis sollte der Radius größer sein als die Varianz. Wählen Sie einen Radius von 0, wenn der Algorithmus selbst einen passenden Radius wählen soll.
fr: Choisissez ici le rayon de flou du gaussien, en pixels, sans compter le pixel central. Pour obtenir des résultats raisonnables, le rayon devra être supérieur à l'écart. Si vous utilisez un rayon de 0, les opérations de flou sélectionnent un rayon approprié.

source: Select here the standard deviation of the blur Gaussian.
de: Wählen Sie hier die Standardvarianz des gaußschen Weichzeichners.
fr: Choisissez ici l'écart-type du flou gaussien.

source: Select here the median radius of the pixel neighborhood. The algorithm applies a digital filter that improves the quality of noisy images. Each pixel is replaced by the median in a set of neighboring pixels as defined by the radius.
de: Wählen Sie hier den Mittelwertradius der Pixelnachbarschaft. Der Algorithmus wendet einen digitalen Filter zur Verbesserung der Qualität eines verrauschten Bildes an. Jeder Pixel wird ersetzt durch den Mittelwert der Pixel in seiner Nachbarschaft, die durch den Radius definiert wurde.
fr: Choisissez ici le rayon médian du voisinage des pixels. L'algorithme applique un filtre numérique qui améliore la qualité des images bruyantes. Chaque pixel est remplacé par le médian dans un ensemble de pixels du voisinage comme défini par le rayon.

source: Select here the noise reduction radius value. The algorithm smooths the contours of an image while still preserving edge information. The algorithm works by replacing each pixel with its neighbor closest in value. A neighbor is defined by the radius. If you use a radius of 0 the algorithm selects a suitable radius.
de: Wählen Sie hier den Wert des Radius der Rauschreduktion. Der Algorithmus glättet die Konturen eines Bildes und erhält dabei die Kanteninformationen. Dazu wird jeder Pixel durch den Nachbarn mit dem nächsten Wert ersetzt. Die Nachbarn werden durch den Radius definiert. Wählen Sie einen Radius von 0, wenn der Algorithmus selbst einen passenden Radius wählen soll.
fr: Choisissez ici la valeur du rayon de réduction de bruit, en pixels. L'algorithme adoucit les contours d'une image tout en préservant les informations relatives aux contours. L'algorithme fonctionne en remplaçant chaque pixel par son voisin le plus proche en termes de valeur. Un voisin est défini par le rayon. Si vous utilisez un rayon de 0, l'algorithme sélectionne un rayon approprié.

source: Select here the radius of the sharpen Gaussian, not counting the center pixel. For reasonable results, the radius should be larger than deviation. If you use a radius of 0 the sharpen operation selects a suitable radius.
de: Wählen Sie hier den Schärferadius des gaußschen Filters. Der Pixel in der Mitte wird dabei nicht mitgezählt. Für ein brauchbares Ergebnis sollte der Radius größer sein als die Varianz. Benutzen Sie einen Radius von 0, wenn der Algorithmus selbst einen passenden Radius wählen soll.
fr: Choisissez ici le rayon de netteté du flou gaussien, en pixels, sans compter le pixel central. Pour obtenir des résultats raisonnables, le rayon devra être supérieur à l'écart. Si vous utilisez un rayon de 0, l'opération de netteté sélectionne un rayon approprié.

source: Select here the sharpen deviation value of the Laplacian.
de: Wählen Sie hier die Schärfevarianz des Laplace.
fr: Choisissez ici la valeur de l'écart de netteté du filtre laplacien.

source: Select here the radius of the unsharpen Gaussian, not counting the center pixel. The algorithm convolve the image with a Gaussian operator of the given radius and standard deviation. For reasonable results, radius should be larger than sigma. If you use a radius of 0 the algorithm selects a suitable radius.
de: Wählen Sie hier den Unschärferadius des gaußschen Filters. Der Pixel in der Mitte wird dabei nicht mitgezählt. Der Algorithmus nutzt einen gaußschen Operator mit einem gegebenen Radius und Varianz. Für ein brauchbares Ergebnis sollte der Radius größer sein als die Varianz. Benutzen Sie einen Radius von 0, wenn der Algorithmus selbst einen passenden Radius wählen soll.
fr: Choisissez ici le rayon du flou gaussien optimisé, en pixels, sans compter le pixel central. L'algorithme convolue l'image avec un opérateur gaussien du rayon donné et un écart-type. Pour obtenir des résultats raisonnables, le rayon devra être supérieur à sigma. Si vous utilisez un rayon de 0, l'algorithme sélectionne un rayon approprié.

source: Select here the unsharpen deviation value of the Gaussian.
de: Wählen Sie hier die Unschärfevarianz des gaußschen Filters.
fr: Sélectionnez ici la valeur de l'écart d'accentuation de netteté du flou gaussien.

source: Select here the percentage difference between original and blurred image which should be added to original.
de: Wählen Sie hier den Prozentsatz des Unterschiedes zwischen des Originals und des weichgezeichneten Bildes, der zu dem Original hinzugefügt wird.
fr: Sélectionnez la différence de pourcentage entre l'image originale et floue qui devra être ajoutée à l'original.

source: Amount:
de: Stärke:
fr: Quantité :

source: Select here the unsharpen threshold value, as a percentage of the maximum color component value, needed to apply the difference amount.
de: Wählen Sie hier den Unschärfegrenzwert, als Prozentwert des maximalen Farbkomponentenwerts, der benötigt wird, um den Differenzbetrag zu ermitteln.
fr: Choisissez ici la valeur-seuil de flou optimisé, exprimée en pourcentage par rapport à la valeur de la composante de couleur, nécessaire pour appliquer la différence.

source: Threshold:
de: Schwellwert:
fr: Seuil :

source: Batch Recompress Images
de: Stapel-„Bilder umkomprimieren“
fr: Re-compression d'images par lots

source: Batch recompress images
de: Stapel-„Bilder umkomprimieren“
fr: Re-compression d'images par lots

source: A Kipi plugin to batch recompress images. This plugin uses the "convert" program from the "ImageMagick" package.
de: Ein KIPI-Modul zum Stapel-Bilder-umkomprimieren. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour la re-compression d'images par lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Image Recompression Options
de: Bilder-umkomprimieren-Einstellungen
fr: Options de re-compression des images

# image compression
source: None
de: Keiner
fr: Aucune

source: image file format unsupported.
de: Dateiformat des Bildes wird nicht unterstützt.
fr: le format de fichier image n'est pas pris en charge.

source: Recompression Options
de: Einstellungen zum Umkomprimieren
fr: Options de re-compression

source: <p>The compression value for JPEG target images:</p>
de: <p>Der Kompressionswert des JPEG-Zielbildes:</p>
fr: <p>La valeur de compression des images cible JPEG :</p>

source: JPEG File Format
de: JPEG-Dateiformat
fr: Format de fichier JPEG

source: <p>The compression value for PNG target images:</p>
de: <p>Der Kompressionswert des PNG-Zielbildes:</p>
fr: <p>La valeur de compression des images cible PNG :</p>

source: PNG File Format
de: PNG-Dateiformat
fr: Format de fichier PNG

source: Select here the TIFF compression algorithm.
de: Wählen Sie hier den TIFF-Kompressionsalgorithmus.
fr: Sélectionnez ici l'algorithme de compression TIFF.

source: TIFF File Format
de: TIFF-Dateiformat
fr: Format de fichier TIFF

source: Select here the TGA compression algorithm.
de: Wählen Sie hier den TGA-Kompressionsalgorithmus.
fr: Sélectionnez ici l'algorithme de compression TGA.

source: TGA File Format
de: TGA-Dateiformat
fr: Format de fichier TGA

source: Rename Images
de: Bilder Umbenennen
fr: Renommer les images

source: Batch-rename images
fr: Renommage d'images par lots

source: A Kipi plugin to batch-rename images
fr: Un module externe KIPI pour le renommage d'images par lots

source: Sort by Name
de: Nach Namen sortieren
fr: Trier par nom

source: Sort by Size
de: Nach Größe sortieren
fr: Trier par taille

source: Sort by Date
de: Nach Datum sortieren
fr: Trier par date

source: Rename File
de: Datei umbenennen
fr: Renommer le fichier

# batch process result
source: Skipped
de: Übersprungen
fr: Ignoré

# batch process result
source: Failed
de: Fehlgeschlagen
fr: Échec

source: Batch Resize Images
de: Stapel-Bildgrößenänderung
fr: Redimensionnement d'images par lots

source: Proportional (1 dim.)
fr: Proportionnel (1 dim.)

source: Proportional (2 dim.)
fr: Proportionnel (2 dim.)

source: Non-Proportional
de: Nicht Proportional
fr: Non proportionnel

source: Prepare to Print
de: Druckvorbereitung
fr: Préparation à l'impression

source: Batch resize images
de: Stapel-Bildgrößenänderung
fr: Redimensionnement d'images par lots

source: A Kipi plugin to batch-resize images. This plugin uses the "convert" program from the "ImageMagick" package.
de: Ein KIPI-Modul zur Stapel-Bildgrößenänderung. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour redimensionner des images par lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Image Resizing Options
de: Einstellungen „Bilder Größenänderung“
fr: Options de redimensionnement d'images

source: <p>Select here the image-resize type.</p>
de: <p>Wählen Sie hier den Typ der Größenänderung.</p>
fr: <p>Choisissez ici le type de redimensionnement de l'image.</p>

source: Image-Resize Options
de: Einstellungen von „Größe ändern“
fr: Options de redimensionnement des images

source: Quality Settings
de: Qualitätseinstellungen
fr: Paramètres de qualité

# Filter name
source: &lt;default&gt;
de: &lt;Standard&gt;
fr: &lt;par défaut&gt;

source: Select here the filter name for the resize-image process. This filter will be used like a kernel convolution process during the increased image size rendering.
de: Wählen Sie hier den Filter für „Größe ändern“. Dieser Filter wird beim berechnen zum Vergrößern der Bilder benutzt.
fr: Choisissez ici le nom du filtre du processus de redimensionnement des images. Ce filtre sera utilisé comme processus de convolution du noyau pendant le rendu de la taille des images agrandies.

source: Image quality (percent):
de: Bildqualität (in Prozent):
fr: Qualité de l'image (pourcentage) :

source: Quality for compressed images.
de: Qualität der komprimierten Bilder.
fr: Qualité des images comprimées.

source: Size Settings
de: Größeneinstellungen
fr: Paramètres de taille

source: New size (pixels):
de: Neue Größe (Pixel):
fr: Nouvelle taille (en pixels) :

source: The new images' size in pixels.
de: Die neue Bildgröße in Pixeln.
fr: La nouvelle taille des images, en pixels.

source: <p><b>Proportional (1 dim.)</b>: standard auto-resizing using one dimension. The width or the height of the images will be automatically selected, depending on the images' orientations. The images' aspect ratios are preserved.</p>
de: <p><b>Proportional (1 Dim.)</b>: automatische Größenänderung unter Berücksichtigung einer Dimension. Die Breite oder Höhe des Bildes wird automatisch, in Abhängigkeit von der Bildrotation, angepasst. Das Verhältnis von Breite zu Höhe bleibt unverändert.</p>
fr: <p><b>Proportionnel (1 dim.)</b> : redimensionnement automatique standard utilisant une seule dimension. La largeur ou la hauteur des images sera automatiquement sélectionnée, en fonction de l'orientation des images. Les rapports hauteur/largeur sont préservés.</p>

source: Width (pixels):
de: Breite (Pixel):
fr: Largeur (pixels) :

source: The new images' width in pixels.
de: Die neue Bildbreite in Pixeln.
fr: La nouvelle largeur des images, en pixels.

source: Height (pixels):
de: Höhe (Pixel):
fr: Hauteur (pixels) :

source: The new images' height in pixels.
de: Die neue Bildhöhe in Pixeln.
fr: La nouvelle hauteur des images, en pixels.

source: Fill image to specified size
fr: Remplir l'image à une taille spécifiée

source: If this box is set, the resulting image is filled up with the specified background color to the desired dimension, otherwise it is only as big as needed to fit the original image into the specified dimensions.
fr: Si cette case est cochée, l'image résultante est remplie à la dimension souhaitée avec la couleur de fond spécifiée, sinon elle sera aussi grande que nécessaire pour s'adapter à l'image originale dans les dimensions indiquées.

source: Background color:
de: Hintergrundfarbe:
fr: Couleur de fond :

source: You can select here the background color to be used when adapting the images' sizes.
de: Wählen Sie hier die Hintergrundfarbe, die während der Anpassung der Bildgröße benutzt wird.
fr: Vous pouvez choisir ici la couleur de fond à utiliser lors de l'adaptation des tailles des images.

source: <p><b>Proportional (2 dim.)</b>: auto-resizing using two dimensions. The images' aspect ratio are preserved. You can use this, for example, to adapt your images' sizes to your screen size.</p>
de: <p><b>Proportional (2 Dim.)</b>: automatische Größenänderung unter Berücksichtigung zweier Dimensionen. Die Breite oder Höhe des Bildes wird automatisch, in Abhängigkeit von der Bildrotation, angepasst. Das Verhältnis von Breite zu Höhe bleibt unverändert.</p>
fr: <p><b>Proportionnel (2 dim.)</b> : redimensionnement automatique utilisant deux dimensions. Le rapport hauteur/largeur des images est préservé. Vous pouvez utiliser ce paramètre, par exemple, pour adapter la taille des images à la taille de l'écran.</p>

source: <p><b>Non proportional</b>: non-proportional resizing using two dimensions. The images' aspect ratios are not preserved.</p>
de: <p><b>Nicht Proportional</b>: Nicht proportionale Größenänderung in zwei Dimensionen. Das Verhältnis von Breite zu Höhe wird verändert.</p>
fr: <p><b>Non proportionnel</b> : redimensionnement non proportionnel utilisant deux dimensions. Le rapport hauteur/largeur des images n'est pas préservé.</p>

source: Use custom settings
de: Eigene Einstellungen verwenden
fr: Utiliser des paramètres personnalisés

source: If this option is enabled, all printing settings can be customized.
de: Wenn diese Einstellung aktiviert ist, können Druckeinstellungen geändert werden.
fr: Si cette option est cochée, tous les paramètres d'impression peuvent être personnalisés.

source: Printing Standard Settings
de: Druckvoreinstellungen
fr: Paramètres standard d'impression

source: Paper size (cm):
de: Papiergröße (cm):
fr: Taille du papier (cm) :

source: The standard photographic paper sizes in centimeters.
de: Die voreingestellte Fotopapiergröße in Zentimetern.
fr: La taille du papier photographique standard, en centimètres.

source: Print resolution (dpi):
de: Druckauflösung (dpi):
fr: Résolution d'impression (dpi) :

source: The standard print resolutions in dots per inch.
de: Die voreingestellte Druckauflösung in Punkten pro Zoll (dots per inch).
fr: Les résolutions d'impression standard, en points par pouce.

source: Stretch Image
de: Bild strecken
fr: Étirer l'image

source: If this is selected, the image will be stretched to fit the paper dimensions. Otherwise it will be centered on the canvas and the borders will get cropped to achieve the desired paper size.
fr: Si cette option est cochée, l'image sera étirée pour s'adapter aux dimensions du papier. Sinon, elle sera centrée sur la toile et les bordures rognées pour obtenir la taille de papier souhaitée.

source: Printing Custom Settings
de: Individuelle Druckeinstellungen
fr: Paramètres d'impression personnalisés

source: Paper width (cm):
de: Papierbreite (cm):
fr: Largeur du papier (cm) :

source: The customized width of the photographic paper size in centimeters.
de: Die angepasste Fotopapierbreite in Zentimetern.
fr: La largeur personnalisée de la taille du papier photographique, en centimètres.

source: Paper height (cm):
de: Papierhöhe (cm):
fr: Hauteur du papier (cm) :

source: The customized height of the photographic paper size in centimeters.
de: Die angepasste Fotopapierhöhe in Zentimetern.
fr: La hauteur personnalisés de la taille du papier photographique, en centimètres.

source: The customized print resolution in dots per inch.
de: Die angepasste Druckauflösung in Punkten pro Zoll (dots per inch).
fr: La résolution d'impression personnalisés, en points par pouce.

source: <p><b>Prepare to print</b>: prepare the image for photographic printing. The user can set the print resolution and the photographic paper size. The target images will be adapted to the specified dimensions (included the background size, margin size, and background color).</p>
de: <p><b>Druckvorbereitung</b>: bereitet das Bild für den Druck vor. Sie können die Druckauflösung und die Größe des Fotopapiers festlegen. Das Zielbild, inklusive der Hintergrund- und Randgröße und der Hintergrundfarbe, wird dann diesen Dimensionen angepasst.</p>
fr: <p><b>Préparation à l'impression</b> : prépare l'image pour l'impression photographique. L'utilisateur peut définir la résolution d'impression et la taille du papier photographique. Les images cibles seront adaptées aux dimensions indiquées (y compris la taille de l'arrière-plan, la taille de la marge et la couleur de fond).</p>

# NAME OF TRANSLATORS
source: Your names
de: Oliver Dörr, Thomas Reitelbach
fr: Joëlle Cornavin

# EMAIL OF TRANSLATORS
source: Your emails
de: kde@doerr-privat.de, tr@erdfunkstelle.de
fr: jcornavin@laposte.net

source: SET_AT_RUNTIME
fr: DÉFINIR_LORS_DE_L'EXÉCUTION

source: Preview
de: Vorschau
fr: Aperçu

source: Small preview
de: Kleine Vorschau
fr: Petit aperçu

source: Add
de: Hinzufügen
fr: Ajouter

source: Remove
de: Entfernen
fr: Supprimer

source: Destination folder:
de: Zielordner:
fr: Dossier de destination :

source: Overwrite mode:
de: Überschreibmodus:
fr: Mode d'écrasement :

source: Remove original
de: Originale löschen
fr: Supprimer l'original

source: Original Image
de: Originalbild
fr: Image originale

source: This is the original image preview. You can use the mouse wheel to change the zoom factor. Click in and use the mouse to move the image.
de: Dies ist die Originalbildvorschau. Sie können den Zoomfaktor mit dem Mausrad ändern. Klicken Sie in das Bild und benutzen Sie die Maus, um das Bild zu verschieben.
fr: Il s'agit d'un aperçu de l'image originale. Vous pouvez utiliser la molette de la souris pour changer le facteur de zoom. Cliquez sur l'image et déplacez-la à l'aide de la souris.

source: Destination Image
de: Zielbild
fr: Image de destination

source: This is the destination image preview. You can use the mouse wheel to change the zoom factor. Click in and use the mouse to move the image.
de: Dies ist die Zielbildvorschau. Sie können den Zoomfaktor mit dem Mausrad ändern. Klicken Sie in das Bild und benutzen Sie die Maus, um das Bild zu verschieben.
fr: Il s'agit de l'aperçu de l'image de destination. Vous pouvez utiliser la molette de la souris pour changer le facteur de zoom. Cliquez sur l'image et déplacez-la à l'aide de la souris.

source: Template for renaming files
de: Vorlage zum Umbenennen von Bildern
fr: Modèle de renommage de fichiers

source: Sequence number start value:
de: Startwert der Nummerierung:
fr: Valeur initiale du numéro de séquence :

source: Prefix string:
de: Präfix-Zeichenkette:
fr: Chaîne de préfixe :

source: Add original file name
de: Originaldateiname hinzufügen
fr: Ajouter le nom du fichier original

source: Add file date
de: Dateidatum hinzufügen
fr: Ajouter la date du fichier

source: Use extra [X*] symbols in date format field
fr: Utiliser des symboles supplémentaires [X*] dans le champ « Format de date »

source: Date format:
de: Datumsformat:
fr: Format de date :

source: Reverse List
de: Umgekehrte Liste
fr: Inverser la liste

source: Sort List
de: Liste sortieren
fr: Trier la liste

source: Move &Down
de: A&bwärts verschieben
fr: &Déplacer vers le bas

source: Move &Up
de: A&ufwärts verschieben
fr: Déplacer vers le ha&ut

source: (c) 2003-2009, Gilles Caulier (c) 2007-2009, Aurélien Gateau
de: © 2003–2009, Gilles Caulier © 2007–2009, Aurélien Gateau

# color image filter
source: Monochrome
de: Monochrom

source: Distance:
de: Abstand:

source: Amplitude:
de: Ausschlag:

source: Type:
de: Typ:

source: Options...
de: Einstellungen ...

# List of images to process
source: Source
de: Quelle

source: Destination
de: Ziel
