Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_batchprocessimages.po
Languages: de, fr

source: Source Album
de: Quellalbum
fr: Album source

source: Source Image
de: Quellbild
fr: Image source

source: Target Image
de: Zielbild
fr: Image cible

source: Result
de: Ergebnis
fr: Résultat

source: <p>You can see here the operations' results during the process. Double-click on an item for more information once the process has ended.</p><p>You can use the "Add" button or drag-and-drop to add some new items to the list.</p><p>If the items are taken from different Albums the process' results will be merged to the target Album.</p>
de: <p>Hier können Sie das Ergebnis während des Vorgangs betrachten. Nach Abschluss des Vorgangs zeigt ein Doppelklick auf einen Eintrag weitere Informationen an.</p><p>Sie können den Knopf „Hinzufügen“ drücken oder durch „Ziehen und Ablegen“ weitere Bilder zur Liste hinzufügen. </p><p>Falls die Bilder aus mehreren Alben stammen, wird das Ergebnis im Zielalbum angezeigt.</p>
fr: <p>Vous pouvez voir ici les résultats des opérations pendant le traitement. Double-cliquez sur un élément pour plus d'informations une fois que le processus s'est terminé.</p><p>Vous pouvez utiliser le bouton « Ajouter » ou faire un glisser-déposer pour ajouter quelques nouveaux éléments à la liste.</p><p>Si les éléments sont tirés d'albums différents, les résultats du traitement seront fusionnés dans l'album cible.</p>

source: Handbook
de: Handbuch
fr: Manuel utilisateur

source: Batch Process Preview (%1 - %2)
de: Stapelverarbeitungs-Vorschau (%1 – %2)
fr: Aperçu du traitement par lots (%1 - %2)

source: Batch process images
de: Stapel-Bildverarbeitung
fr: Traitement d'images par lots

source: An interface to preview the "Batch Process Images" Kipi plugin. This plugin uses the "convert" program from the "ImageMagick" package.
de: Ein Fenster zur Vorschau der Stapel-Bilderverarbeitungs-KIPI-Module. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Une interface pour afficher un aperçu du module KIPI de traitement d'images par lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Author
de: Autor
fr: Auteur

source: Maintainer
de: Betreuer
fr: Mainteneur

source: Preview image processing in progress...
de: Bildvorschau wird erstellt ...
fr: Traitement de l'image d'aperçu en cours...

source: Cannot start 'convert' program from 'ImageMagick' package; please check your installation.
de: Das Programm „convert“ aus dem Paket „ImageMagick“ lässt sich nicht starten. Bitte überprüfen Sie Ihre Installation.
fr: Impossible de démarrer le programme « Convert » provenant du paquetage « ImageMagick ». Veuillez vérifier votre installation.

source: Cannot process preview image.
de: Die Bildvorschau kann nicht erstellt werden.
fr: Impossible de traiter l'image d'aperçu.

# start batch process images
source: &Start
de: &Starten
fr: &Démarrer

source: You can choose here the options to use for the current process.
de: Hier lassen sich die Einstellungen des aktuellen Vorgangs ändern.
fr: Vous pouvez choisir ici les options à utiliser pour le processus en cours.

source: If you enable this option, all preview effects will be calculated on a small zone of the image (300x300 pixels in the top left corner). Enable this option if you have a slow computer.
de: Wenn diese Einstellung aktiviert ist, werden alle Vorschaueffekte für einen kleinen Bereich des Bildes (300x300 Pixel in der linken oberen Ecke) berechnet. Schalten Sie diese Option auf langsamen Rechnern ein.
fr: Si vous cochez cette option, tous les effets d'aperçus seront calculés sur une petite partie de l'image (300x300 pixels dans le coin supérieur gauche). Cochez cette option si vous avez un ordinateur lent.

source: This button builds a process preview for the currently selected image on the list.
de: Mit diesem Knopf können Sie eine Vorschau der ausgewählten Bilder erzeugen.
fr: Ce bouton construit un aperçu du processus pour l'image actuellement sélectionnée sur la liste.

source: Ask
de: Nachfragen
fr: Demander

source: Always Overwrite
de: Immer überschreiben
fr: Toujours écraser

source: Rename
de: Umbenennen
fr: Renommer

source: Skip
de: Überspringen
fr: Ignorer

source: Select here the overwrite mode used if your target's image files already exist.
de: Wählen Sie hier den Überschreibmodus für den Fall, dass die Zieldatei bereits vorhanden ist.
fr: Choisissez ici le mode d'écrasement utilisé si les fichiers image de la cible existent déjà.

source: If you enable this option, all original image files will be removed after processing.
de: Wenn diese Einstellung aktiviert ist, werden die Originalbilddateien gelöscht.
fr: Si vous cochez cette option, tous les fichiers image originaux seront supprimés après traitement.

source: Here you can select the target folder which will used by the process.
de: Hier können Sie den Zielordner auswählen, der von der Stapelverarbeitung benutzt wird.
fr: Vous pouvez choisir ici le dossier cible qui sera utilisé par le processus.

source: Add images to the list.
de: Fügt Bilder zur Liste hinzu.
fr: Ajoutez des images à la liste.

source: Remove selected image from the list.
de: Entfernt das ausgewählte Bild aus der Liste.
fr: Supprimez l'image sélectionnée de la liste.

source: The preview of the selected image on the list.
de: Die Vorschau des ausgewählten Bildes in der Liste.
fr: L'aperçu de l'image sélectionnée sur la liste.

source: All original image files will be removed from the source Album. Do you want to continue?
de: Alle Originalbilddateien werden aus dem Quellalbum gelöscht. Möchten Sie fortfahren?
fr: Tous les fichiers image originaux seront supprimés de l'album source. Voulez-vous continuer ?

source: Delete Original Image Files
de: Originalbilddateien löschen
fr: Supprimer les fichiers image originaux

source: &Stop
de: &Stopp
fr: &Arrêter

source: You must specify a writable path for your output file.
de: Sie müssen einen Pfad für die Zieldatei angeben, für den Sie Schreibrechte besitzen.
fr: Vous devez spécifier un emplacement inscriptible pour votre fichier de sortie.

source: The destination file "%1" already exists; do you want overwrite it?
de: Die Zieldatei namens „%1“ ist bereits vorhanden. Soll Sie überschrieben werden?
fr: Le fichier de destination « %1 » existe déjà. Voulez-vous l'écraser ?

source: Overwrite Destination Image File
de: Zieldatei überschreiben
fr: Écraser le fichier image de destination

source: Skipped.
de: Übersprungen.
fr: Ignoré.

source: destination image file already exists (skipped by user).
de: Die Zieldatei existiert bereits (durch den Benutzer übersprungen).
fr: le fichier image de destination existe déjà (ignoré par l'utilisateur).

# batch process result
source: Failed.
de: Fehlgeschlagen
fr: Échec.

source: destination image file already exists and cannot be renamed.
de: Die Zieldatei existiert bereits und lässt sich nicht umbenennen.
fr: le fichier image de destination existe et il 'est pas possible de le renommer.

source: destination image file already exists (skipped automatically).
de: Die Zieldatei existiert bereits (automatisch übersprungen).
fr: le fichier image de destination existe déjà (ignoré automatiquement).

source: The 'convert' program from 'ImageMagick' package has been stopped abnormally
de: Das Programm „convert“ aus dem Paket „ImageMagick“ wurde unerwartet beendet.
fr: Le programme « Convert » provenant du paquetage « ImageMagick » s'est arrêté de façon anormale

source: Error running 'convert'
de: Fehler beim Ausführen von „convert“
fr: Problème lors de l'exécution de « Convert »

source: 'convert' program from 'ImageMagick' package has been stopped abnormally.
de: Das Programm „convert“ aus dem Paket „ImageMagick“ wurde unerwartet beendet.
fr: Le programme « Convert » provenant du paquetage « ImageMagick » s'est arrêté de façon anormale.

source: no processing error
de: Kein Bearbeitungsfehler
fr: pas d'erreur de traitement

source: <qt>Error adding image to application; error message was: <b>%1</b></qt>
de: <qt>Fehler beim Hinzufügen des Bildes zum Programm. Die Fehlermeldung lautet: <b>%1</b></qt>
fr: <qt>Problème lors de l'ajout d'image à l'application. Le message d'erreur est : <b>%1</b></qt>

source: Error Adding Image to Application
de: Fehler beim Hinzufügen des Bildes zum Programm
fr: Problème lors de l'ajout d'image à l'application

# batch process result
source: Warning:
de: Warnung:
fr: Avertissement :

source: cannot remove original image file.
de: Die Originalbilddatei lässt sich nicht löschen.
fr: impossible de supprimer le fichier image original.

source: cannot process original image file.
de: Die Originalbilddatei lässt sich nicht verarbeiten.
fr: impossible de traiter le fichier image original.

source: Image processing error
de: Fehler bei der Bildverarbeitung.
fr: Problème lors du traitement de l'image

source: Image "%1": %2 The output messages are:
de: Bild „%1“: %2 Die Ausgabemeldungen lauten:
fr: Image « %1 » : %2 Les messages de sortie sont :

source: You must select an item from the list to calculate the preview.
de: Sie müssen ein Bild aus der Liste auswählen, bevor eine Vorschau erzeugt werden kann.
fr: Vous devez sélectionner un élément provenant de la liste pour calculer l'aperçu.

source: Cannot run properly 'convert' program from 'ImageMagick' package.
de: Das Programm „convert“ aus dem Paket „ImageMagick“ lässt sich nicht starten.
fr: Impossible d'exécuter correctement le programme « Convert » provenant du paquetage « ImageMagick ».

source: - small preview
de: – kleine Vorschau
fr: - petit aperçu

source: Preview processing error
de: Fehler beim Verarbeiten der Vorschau.
fr: Problème lors du traitement de l'aperçu

source: Cannot process preview for image "%1". The output messages are:
de: Die Vorschau für das Bild namens „%1“ lässt sich nicht erstellen. Die Ausgabemeldungen lauten:
fr: Impossible de traiter l'aperçu pour l'image « %1 ». Les messages de sortie sont :

source: Aborted.
de: Abgebrochen.
fr: Interrompu.

source: process aborted by user
de: Der Vorgang ist durch den Benutzer abgebrochen worden.
fr: processus interrompu par l'utilisateur

source: &Close
de: &Schließen
fr: &Fermer

source: Border Images...
de: Bilder einrahmen ...
fr: Border des images...

source: Color Images...
de: Farbfilter ...
fr: Colorer les images...

source: Convert Images...
de: Bilderkonvertierung ...
fr: Convertir les images...

source: Image Effects...
de: Bildeffekte ...
fr: Effets sur les images...

source: Filter Images...
de: Bilder filtern ...
fr: Filtrer les images...

source: Rename Images...
de: Umbenennen ...
fr: Renommer les images...

source: Recompress Images...
de: Bilder umkomprimieren ...
fr: Comprimer à nouveau les images...

source: Resize Images...
de: Größe ändern ...
fr: Redimensionner les images...

source: Please select an album or a selection of images.
de: Bitte wählen Sie ein Album oder eine Gruppe von Bildern aus.
fr: Veuillez choisir un album ou une sélection d'images.

source: Batch-Bordering Images
de: Stapel-Bildumrahmung
fr: Bordure des images en lots

source: Batch Image-bordering
de: Stapel-Bildumrahmung
fr: Bordure des images en lots

source: A Kipi plugin for batch bordering images This plugin use the "convert" program from "ImageMagick" package.
de: Ein KIPI-Modul zur Stapel-Bildumrahmung. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour la bordure des images en lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Images Bordering Options
de: Einstellungen zur Bildumrahmung
fr: Options de bordure des images

source: Border:
de: Rahmen:
fr: Bordure :

# image border type
source: Solid
de: Durchgehend
fr: Continue

# image border type
source: Raise
de: Erhöhung
fr: Mettre au premier plan

# image border type
source: Frame
de: Rahmen
fr: Cadre

source: <p>Select here the border type for your images:</p><p><b>Solid</b>: just surround the images with a line.<br/><b>Niepce</b>: surround the images with a fine line and a large border (ideal for black and white pictures).<br/><b>Raise</b>: creating a 3D effect around the images.<br/><b>Frame</b>: surround the images with an ornamental border.</p>
de: <p>Wählen Sie hier die Art des Rahmens für Ihre Bilder:</p><p><b>Durchgehend</b>: eine einfache Linie um die Bilder<br/><b>Niepce</b>: umgibt die Bilder mit einer dünnen Linie und einem dicken Rahmen (ideal für Schwarz/Weiß-Bilder)<br/><b>Anheben</b>: erstellt einen 3D-Effekt um die Bilder<br/><b>Rahmen</b>: umgibt die Bilder mit einem dekorativen Rahmen</p>
fr: <p>Choisissez ici le type de bordure de vos images :</p><b>Continue</b> : entoure simplement les images d'une ligne.<br/><b>Niepce</b> : entoure les images d'une ligne fine et d'une bordure épaisse (idéal pour les images noir et blanc).<br/></b>Mettre au premier plan</b> : crée un effet 3D autour des images.<br/><b>Cadre</b> : entoure les images d'une bordure ornementale.</p>

source: Border Options
de: Rahmeneinstellungen
fr: Options des bordures

source: Border width:
de: Rahmenbreite:
fr: Largeur de la bordure :

source: Select here the border width in pixels.
de: Wählen Sie hier die Rahmenbreite in Pixeln.
fr: Choisissez ici la largeur de la bordure en pixels.

source: Border color:
de: Rahmenfarbe:
fr: Couleur de la bordure :

source: You can select here the border color.
de: Wählen Sie hier die Rahmenfarbe.
fr: Vous pouvez choisir ici la couleur de la bordure.

source: Line border width:
de: Breite der Rahmenlinie:
fr: Largeur de bordure de ligne :

source: Select here the line border width in pixels.
de: Wählen Sie hier die Breite der Rahmenlinie in Pixeln.
fr: Choisissez ici la largeur de bordure de ligne en pixels.

source: Line border color:
de: Farbe der Rahmenlinie:
fr: Couleur de bordure de ligne :

source: You can select here the line border color.
de: Wählen Sie hier die die Farbe der Rahmenlinie.
fr: Vous pouvez choisir ici la couleur de bordure de ligne.

source: Bevel width:
de: Kantenbreite:
fr: Largeur de biseau :

source: Select here the bevel width in pixels. This value must be &lt;= Border width / 2
de: Wählen Sie hier die Kantenbreite in Pixeln. Der Wert muss kleiner oder gleich der Rahmenbreite geteilt durch 2 sein.
fr: Choisissez ici la largeur de biseau en pixels. Cette valeur doit être &lt;= Largeur de bordure / 2

source: Batch Image-Color Processing
de: Stapel-Bildfarben-Verbesserung
fr: Traitement de la couleur des images en lots

source: Batch image-color enhancement
de: Stapel-Bildfarben-Verbesserung
fr: Amélioration de la couleur des images en lots

source: A Kipi plugin for batch image-color enhancement. This plugin use the "convert" program from the "ImageMagick" package.
de: Ein KIPI-Modul zur Stapel-Bildfarben-Verbesserung. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour l'amélioration de la couleur des images en lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Image Coloring Options
de: Bildfarben-Einstellungen
fr: Options de coloration des images

source: Filter:
fr: Filtre :

# color image filter
source: Decrease Contrast
de: Kontrast verringern
fr: Diminution du contraste

# color image filter
source: Depth
de: Farbtiefe
fr: Profondeur

# color image filter
source: Equalize
de: Angleichen
fr: Égalisation

# color image filter
source: Fuzz
de: Verzerren
fr: Tolérance

# color image filter
source: Gray Scales
de: Graustufen
fr: Échelles de gris

# color image filter
source: Increase Contrast
de: Kontrast erhöhen
fr: Augmentation du contraste

# color image filter
source: Negate
de: Invertieren
fr: Inversion des couleurs

# color image filter
source: Normalize
de: Normalisieren
fr: Normalisation

# color image filter
source: Segment
de: Segmentieren
fr: Segmentation

# color image filter
source: Trim
de: Trimmen
fr: Rognage

source: Normalize
de: Normalisieren
fr: Normalisation

source: <p>Select here the color enhancement type for your images:</p><p><b>Decrease contrast</b>: reduce the image contrast. The algorithm reduces the intensity difference between the lighter and darker elements of the image.<br/><b>Depth</b>: change the color depth of the image.<br/><b>Equalize</b>: perform histogram equalization to the image.<br/><b>Fuzz</b>: merging colors within a distance, i.e. consider them to be equal.<br/><b>Gray scales</b>: convert color images to grayscale images.<br/><b>Increase contrast</b>: enhance the image contrast. The algorithm enhances the intensity differences between the lighter and darker elements of the image.<br/><b>Monochrome</b>: transform the image to black and white.<br/><b>Negate</b>: replace every pixel with its complementary color. The red, green, and blue intensities of an image are negated. White becomes black, yellow becomes blue, etc.<br/><b>Normalize</b>: transform image to span the full range of color values. This is a contrast enhancement technique. The algorithm enhances the contrast of a colored image by adjusting the pixels color to span the entire range of colors available.<br/><b>Segment</b>: segment an image by analyzing the histograms of the color components and identifying units that are homogeneous with the fuzzy c-means technique.<br/><b>Trim</b>: trim an image (fuzz reverse technique). The algorithm remove edges that are the background color from the image.</p>
de: <p>Wählen Sie hier den Typ der Farbverbesserung für Ihre Bilder:</p><p><b>Kontrast verringern</b>: Reduziert den Bildkontrast. Der Algorithmus reduziert die Differenz der Intensitäten zwischen den helleren und den dunkleren Bildelementen.<br/><b>Farbtiefe</b>: Ändert die Farbtiefe eines Bildes.<br/><b>Angleichen</b>: Führt einen Histogrammabgleich für das Bild durch.<br/><b>Verzerren</b>: Führt Farben innerhalb eines Abstands zu einer zusammen.<br/><b>Kontrast erhöhen</b>: Erhöht den Bildkontrast. Der Algorithmus erhöht die Differenz der Intensitäten zwischen den helleren und den dunkleren Bildelementen.<br/><b>Monochrom</b>: Transformiert das Bild in ein Schwarz/Weiß-Bild.<br/><b>Invertieren</b>: Ersetzt jedes Pixel durch eines mit der Komplementärfarbe. Die Intensität von Rot, Grün und Blau eines Bildes wird negiert. Weiß wird Schwarz, Gelb wird Blau usw.<br/><b>Normalisieren</b>: Verändert ein Bild, damit es den vollen Farbbereich ausnutzt. Es handelt sich hierbei um eine Technik zur Kontrastverbesserung. Der Algorithmus erweitert den Kontrast eines Farbbildes durch Erweiterung der Pixelfarben auf den gesamten verfügbaren Farbbereich.<br/><b>Segmentieren</b>: Segmentiert ein Bild durch Analyse des Histogramms der Farbkomponenten und Identifizierung von homogenen Bereichen mit der fuzzy-c-means-Technik.<br/><b>Trimmen</b>: Trimmt ein Bild (umgekehrte Verzerrtechnik). Der Algorithmus entfernt Kanten, die die Hintergrundfarbe des Bildes haben.</p>
fr: <p>Choisissez ici le type d'amélioration de la couleur de vos images :</p><p><b>Diminution du contraste</b> réduit le contraste de l'image. L'algorithme réduit la différence d'intensité entre les éléments plus clairs et plus foncés de l'image.<br/><b>Profondeur</b> : change la profondeur de couleur de l'image.<br/><b>Égalisation</b> : effectue une égalisation de l'histogramme à l'image.<p><b>Tolérance</b> : fusion des couleurs dans une distance, c'est-à-dire les considérer comme étant égales.<br/><b>Échelles de gris</b> : convertit la couleurs des images en images en échelles de gris.<p><b>Augmentation du contraste</b> : améliore le contraste de l'image. L'algorithme améliore les différences d'intensité entre les éléments plus clairs et plus foncés de l'image.<br/><b>Monochrome</b> : transforme l'image en noir et blanc.<br/><b>Inversion des couleurs</b> : remplace chaque pixel par sa couleur complémentaire. Les intensités rouge, vert et bleu d'une image sont inversées. Le blanc devient noir, le jaune devient bleu, etc.<br/><b>Normalisation</b> : transforme l'image de façon à développer la palette complète des valeurs des couleurs. C'est une technique d'amélioration du contraste. L'algorithme améliore le contraste d'une image colorée en ajustant la couleur des pixels de façon à développer la palette complète des couleurs disponibles.<b/><b>Segmentation</b> : segmente une image en analysant les histogrammes des composants des couleurs et en identifiant les unités qui sont homogènes avec la technique « fuzzy c-means ».<br/><b>Rognage</b> : rogne une image (technique « fuzz reverse »). L'algorithme supprime les bords constituent la couleur de fond de l'image.</p>

source: Color Options
de: Farbeinstellungen
fr: Options de couleur

source: Depth value:
de: Farbtiefe:
fr: Valeur de profondeur :

source: Select here the image depth in bits.
de: Wählen Sie hier die Farbtiefe des Bildes in Bit.
fr: Sélectionnez ici la profondeur d'image en bits.

source: Select here the fuzz distance in absolute intensity units.
de: Wählen Sie hier den Verzerrabstand in absoluten Intensitätseinheiten.
fr: Choisissez ici la distance de tolérance en unités d'intensité absolue.

source: Cluster threshold:
de: Cluster-Grenzwert:
fr: Seuil d'accumulation :

source: Select here the value which represents the minimum number of pixels contained in a hexahedron before it can be considered valid.
de: Wählen Sie hier den Wert, der die minimale Anzahl von Pixeln in einem Hexahedron bestimmt, bevor es als gültig behandelt wird.
fr: Choisissez ici la valeur représentant le nombre minimal de pixels contenus dans un hexahèdre avant qu'il puisse être considéré comme valable.

source: Smooth threshold:
de: Glättungs-Grenzwert:
fr: Taux de lissage :

source: Select here the value which eliminates noise in the second derivative of the histogram. As the value is increased, you can expect a smoother second derivative.
de: Wählen Sie hier den Wert, der das Rauschen im zweiten Derivat des Histogramms entfernt. Mit einem höheren Wert können Sie ein glatteres zweites Derivat erwarten.
fr: Choisissez ici la valeur qui élimine le bruit dans la seconde dérivée de l'histogramme. Lorsque la valeur est augmentée, vous pouvez espérer une seconde dérivée plus lisse.

source: Batch Convert Images
de: Stapel-Bildkonvertierung
fr: Conversion d'images en lots

source: Batch convert images
de: Stapel-Bildkonvertierung
fr: Conversion d'images en lots

source: A Kipi plugin for batch converting images. This plugin uses the "convert" program from the "ImageMagick" package.
de: Ein KIPI-Modul zur Stapel-Bildkonvertierung. Dieses Modul benutzt das Programm „convert“ aus dem Paket „ImageMagick“.
fr: Un module externe KIPI pour la conversion d'images en lots. Ce module externe utilise le programme « Convert » provenant du paquetage « ImageMagick ».

source: Image Conversion Options
de: Einstellungen zur Bilderkonvertierung
fr: Options de la conversion d'images

source: <p>Select here the target image file format.</p>
de: <p>Wählen Sie hier das Dateiformat der Zielbilder.</p>
fr: <p>Sélectionnez ici le format de fichier d'image cible.</p>
