Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_kioexportimport.po
Languages: fr

source: Export to Remote Computer
fr: Exporter vers un ordinateur distant

source: Start export
fr: Lancer l'exportation

source: Start export to the specified target
fr: Lancer l'exporation vers la cible spécifiée

source: Export to remote computer
fr: Exporter vers un ordinateur distant

source: A Kipi plugin to export images over network using KIO-Slave
fr: Un module Kipi pour exporter des images par le réseau en utilisant les KIO-Slaves

source: Developer and maintainer
fr: Développeur et responsable

source: Handbook
fr: Manuel

source: Some of the images have not been transferred and are still in the list. You can retry to export these images now.
fr: Certaines images n'ont pas été transférées et sont toujours dans la liste. Vous pouvez réessayer d'exporter ces images maintenant.

source: Upload not completed
fr: Envoi non fini

source: This is the list of images to import into the current album.
fr: Voici la liste des images à importer dans l'album courant.

source: Import from Remote Computer
fr: Importer depuis un ordinateur distant

source: Start import
fr: Lancer l'import

source: Start importing the specified images into the currently selected album.
fr: Lancer l'importation des images spécifiées dans l'album actuellement sélectionné.

source: Import from remote computer
fr: Importer depuis un ordinateur distant

source: A Kipi plugin to import images over network using KIO-Slave
fr: Un module Kipi pour importer des images par le réseau en utilisant les KIO-Slaves

source: Some of the images have not been transferred and are still in the list. You can retry to import these images now.
fr: Certaines images n'ont pas été transférées et sont toujours dans la liste. Vous pouvez réessayer d'importer ces images maintenant.

source: Import not completed
fr: Importation non terminée

source: Export to remote computer...
fr: Exporter vers un ordinateur distant...

source: Import from remote computer...
fr: Importer depuis un ordinateur distant...

source: Target location:
fr: Emplacement cible :

source: Sets the target address to upload the images to. This can be any address as used in Dolphin or Konqueror, e.g. ftp://my.server.org/sub/folder.
fr: Indique l'adresse cible vers laquelle envoyer les images. Celà peut être n'importe quelle adresse utilisable dans Dolphin ou Konqueror, par exemple « ftp://mon.serveur.org/sous/dossier ».

source: Select target...
fr: Sélectionner la cible...

source: Select target location...
fr: Sélectionner l'emplacement cible...

source: This is the list of images to upload to the specified target.
fr: C'est la liste des images à envoyer vers la cible spécifiée.

source: not selected
fr: non sélectionné

# NAME OF TRANSLATORS
source: Your names
fr: Guillaume Pujol

# EMAIL OF TRANSLATORS
source: Your emails
fr: guill.p@gmail.com
