Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_ipodexport.po
Languages: de

source: Export to &iPod...
de: Auf &iPod exportieren ...

source: A tool to export image to an iPod device
de: Ein KIPI-Modul zum Exportieren von Bildern auf einen iPod.

source: (c) 2006-2008, Seb Ruiz (c) 2008-2010, Gilles Caulier
de: © 2006–2008, Seb Ruiz © 2008–2010, Gilles Caulier

source: Author and Maintainer
de: Autor und Betreuer

source: Developer
de: Entwickler

source: Plugin Handbook
de: Modul-Handbuch

source: Hard Disk
de: Festplatte

source: &Add...
de: &Hinzufügen ...

source: Add images to be queued for the iPod.
de: Bilder zur Übertragung auf den iPod hinzufügen.

source: &Remove
de: &Entfernen

source: Remove selected image from the list.
de: Die ausgewählten Bilder aus der Liste entfernen.

source: &Transfer
de: Über&tragen

source: Transfer images to the selected iPod album.
de: Die Bilder in das ausgewählte iPod-Album übertragen.

source: The preview of the selected image in the list.
de: Die Vorschau des aus der Liste ausgewählten Bildes.

source: &New...
de: &Neu ...

source: Create a new photo album on the iPod.
de: Ein neues Fotoalbum auf dem iPod erstellen.

source: R&ename...
de: &Umbenennen ...

source: Remove the selected photos or albums from the iPod.
de: Die ausgewählten Fotos oder Alben auf dem iPod löschen.

source: Rename the selected photo album on the iPod.
de: Das ausgewählte Fotoalbum auf dem iPod umbenennen.

source: Image files
de: Bilddateien

source: Add Images
de: Bilder hinzufügen

source: New iPod Photo Album
de: Neues iPod-Fotoalbum

source: Create a new album:
de: Ein neues Album erstellen:

source: Rename iPod Photo Album
de: iPod-Fotoalbum umbenennen

source: New album title:
de: Neuer Albumtitel:

source: An iPod photo database could not be found on the device mounted at %1. Initialize the iPod photo database?
de: Es kann keine iPod-Fotodatenbank auf dem Gerät gefunden werden, das unter %1 eingehängt ist. Soll die Datenbank jetzt initialisiert werden?

source: Initialize iPod Photo Database?
de: iPod-Fotodatenbank initialisieren?

source: &Initialize
de: &Initialisieren

source: <p align="center"><b>No iPod was detected</b></p>
de: <p align="center"><b>Es kann kein iPod gefunden werden.</b></p>

source: Refresh
de: Aktualisieren

source: <p align="center"><b>Your iPod (%1) does not seem to support artwork.</b></p>
de: <p align="center"><b>Ihr iPod (%1) scheint Bilder nicht zu unterstützen.</b></p>

source: Set iPod Model
de: iPod-Modell einstellen

source: <p align="center"><b>iPod %1 detected at: %2</b></p>
de: <p align="center"><b>iPod %1 gefunden unter: %2</b></p>

source: <p align="center"><b>iPod %1 detected</b></p>
de: <p align="center"><b>iPod %1 gefunden</b></p>

source: Unnamed
de: Unbenannt

# NAME OF TRANSLATORS
source: Your names
de: Oliver Dörr

# EMAIL OF TRANSLATORS
source: Your emails
de: kde@doerr-privat.de
