Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_acquireimages.po
Languages: pl

source: Acquire images
pl: Zgraj zdjęcia

source: Developer
pl: Programista

source: Cannot open scanner device.
pl: Nie można uruchomić skanera.

source: Scan Image
pl: Skanuj zdjęcie

source: Handbook
pl: Podręcznik

source: New Image File Name
pl: Nazwa nowego pliku

source: The target image file format "%1" is unsupported.
pl: Żądany format pliku "%1" nie jest wspierany.

source: Failed to save file "%1" to "%2".
pl: Nie można zapisać pliku "%1" do "%2".

source: A file named "%1" already exists. Are you sure you want to overwrite it?
pl: Plik "%1" już istnieje. Na pewno chcesz go nadpisać?

source: Overwrite File?
pl: Nadpisać plik?

# NAME OF TRANSLATORS
source: Your names
pl: Mikołaj Machowski

# EMAIL OF TRANSLATORS
source: Your emails
pl: mikmach@wp.pl
