Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_dropbox.po
Languages: ro

source: Error
ro: Eroare

source: Failed to upload photo
ro: Încărcarea fotografiei a eșuat

source: Failed to list folders
ro: Enumerarea dosarelor a eșuat

source: Export to Dropbox
ro: Exportă în Dropbox

source: Start Upload
ro: Începe încărcarea

source: Start upload to Dropbox
ro: Începe încărcarea în Dropbox

source: Dropbox Export
ro: Export Dropbox

source: A tool to export images to Dropbox
ro: Unealtă de exportat imagini în Dropbox

source: Author
ro: Autor

# @title:window
source: Error
ro: Eroare

source: No image selected. Please select which images should be uploaded.
ro: Nicio imagine aleasă. Alegeți ce imagini trebuiesc încărcate.

source: Login Failed
ro: Autentificare eșuată

source: Authentication failed. Do you want to try again?
ro: Autentificarea a eșuat. Doriți să reîncercați?

source: Dropbox export
ro: Export Dropbox

source: Uploading Failed
ro: Încărcarea a eșuat

source: Failed to upload photo to Dropbox. %1 Do you want to continue?
ro: Încărcarea fotografiei în Dropbox a eșuat. %1 Doriți să continuați?

source: Dropbox call failed: %1
ro: Apelul Dropbox a eșuat: %1

source: &Export
ro: &Exportă

source: Main Toolbar
ro: Bara de unelte principală

source: Export to &Dropbox...
ro: Exportă în &Dropbox…
