Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_removeredeyes.po
Languages: fr

source: Blob Extraction Settings
fr: Paramètres de la tâche d'extraction

source: Minimum &blob size:
fr: Taille minimum de la &tâche :

source: Minimum &roundness:
fr: &Rondeur minimum :

source: Classifier Settings
fr: Paramètres du classeur

source: Use &standard classifier
fr: Utiliser un classeur &standard

source: If checked, the standard classifier shipped with this KIPI plugin is used.
fr: Si coché, le classeur standard fourni avec ce module KIPI est utilisé.

source: Enter the location of the classifier here.
fr: Saisir ici l'emplacement du classeur.

source: &Neighbor groups:
fr: &Groupes voisins :

source: &Scaling factor:
fr: &Facteur d'échelle :

source: &Advanced Mode
fr: Mode &avancé

source: &Simple Mode
fr: Mode &simple

source: <p><b>Slower<br/>(low-res / slightly blurred images)</b></p><p>In this mode the automatic detection and correction of red-eye is the most reliable. The drawback of the higher detection rate is a much slower computation.</p>
fr: <p><b>Plus lent<br/>(basse résolution / images légèrement floues)</b></p><p>Avec ce mode, la détection et la correction automatique des yeux rouges est la plus fiable. L'inconvénient d'un taux de détection plus élevé est un temps de calcul plus long.</p>

source: <p><b>Standard</b></p><p>This mode is adequate for most image resolutions. Always try this mode first.</p>
fr: <p><b>Standard</b></p><p>Ce mode est adéquat pour la plupart des résolutions d'image. Essayez toujours ce mode en premier.</p>

source: <p><b>Faster<br/>(high-res images)</b></p><p>In this mode the automatic detection will be faster, but more false positives may occur. Use this mode only for very high-resolution and sharp images.</p>
fr: <p><b>Plus rapide<br/>(images hautes résolutions)</b></p><p>Avec ce mode la détection automatique sera plus rapide, mais plus de faux positifs peuvent apparaître. Utilisez ce mode pour des images de très haute résolution et très nettes.</p>

source: &Red-Eye Removal...
fr: Suppression des yeux &rouges...

source: Automatic Red-Eye Removal
fr: Suppression automatique des yeux rouges

source: Remove Red-Eye
fr: Retirer les yeux rouges

source: A plugin to automatically detect and remove red-eye effect.
fr: Un module pour détecter automatique les yeux rouges et les supprimer

source: (c) 2008-2009, Andi Clemens
fr: (c) 2009, Andi Clemens

source: Author and Maintainer
fr: Auteur et mainteneur

source: Handbook
fr: Manuel

source: Correct &Photos
fr: Corriger les &photos

source: Start correcting the listed images
fr: Démarrer la correction des images listées

source: &Test-Run
fr: &Test

source: Simulate the correction process, without saving the results.
fr: Simule le processus de correction, sans enregistrer les résultats.

# number of images successfully processed
source: Success:
fr: Succès :

# number of images failed to process
source: Failed:
fr: Échec :

source: File List
fr: Liste les fichiers

source: Settings
fr: Configuration

source: <p>You chose the <b>'overwrite' correction mode</b>.<br/>Are you sure you want to lose your original image files?</p>
fr: <p>Vous choisissez le <b>mode de correction avec écrasement</b>. <br/>Êtes-vous certain de vouloir perdre vos fichiers images originaux ?</p>

source: Overwrite mode
fr: Mode avec écrasement

source: <p>Some of the images could not be analyzed with the current settings, or they do not contain any red-eye at all.</p><p><b>Would you like to remove these images from the list?</b></p>
fr: <p>Certaines des images n'ont pas pu être analysées avec les réglages actuels, ou ne contiennent pas d'oeil rouge.</p><p><b>Voulez-vous retirer ces images de la liste ? </b></p>

source: Remove unprocessed images?
fr: Retirer les images non traitées ?

source: <p>You tried to add <b>RAW images</b> to the plugin,<br/>but those file-types are not supported.</p><p><b>They were automatically removed from the list.</b></p>
fr: <p>Vous avez essayé d'ajouter des <b>images RAW</b> au module, <br/>mais ce type de fichier n'est pas géré.</p><p><b>Ils ont été automatiquement retirés de la liste.</b></p>

source: RAW images found
fr: Des images RAW ont été trouvées

source: <p>%1 image has been successfully processed.</p>
fr: <p>%1 image a été traitée avec succès.</p>

source: <h2>Correction Complete</h2>
fr: <h2>Correction terminée</h2>

source: Correction Complete
fr: Correction terminée

source: <h2>No locator has been loaded.<br/>The plugin is not executable.</h2>
fr: <h2>Aucune localisation n'a été chargée.<br/>Le module n'est pas exécutable.</h2>

source: Corrected Eyes
fr: Yeux corrigés

source: This is the list of images from which to remove red-eye.
fr: Voici la liste des images sur lesquelles il faut retirer les yeux rouges.

source: <p>This widget will display a correction preview for the currently selected image.</p><p><ul><li>Move the mouse <b>over</b> the preview to display the original image.</li><li>Move the mouse <b>out of</b> the preview to display the corrected image.</li><li><b>Click on</b> the preview to display the correction mask.</li></ul></p><p>The zoom buttons and panning widget allow you to view certain parts of the image more closely.</p>
fr: <p>Cet objet affichera un aperçu de la correction pour les images actuellement sélectionnées. </p><p><ul><li>Déplacez la souris <b>sur</b> l'aperçu pour afficher l'image originale. </li><li>Déplacez la souris <b>hors de</b> l'aperçu pour afficher l'image corrigée</li><li><b>Cliquez sur</b> l'aperçu pour afficher le masque de correction. </li></ul></p><p>Les boutons de zoom et le module de panoramique vous permettent de voir certaines parties de l'image de plus près.</p>

source: <h2>generating preview...</h2>
fr: <h2>création de l'aperçu...</h2>

source: <p>Can not open preview image<br/>'%1'</p>.
fr: <p>Impossible d'ouvrir l'aperçu de l'image<br/> « %1 »</p>.

source: Error loading preview file
fr: Erreur lors du chargement du fichier d'aperçu

source: Original Image
fr: Image originale

source: Corrected Image
fr: Image corrigée

source: Correction Mask
fr: Masque de correction

source: No image selected
fr: Aucune image sélectionnée

source: Storage Settings
fr: Configuration de stockage

source: <p>These settings control the storage of the corrected images. There are three modes to choose from:</p><p><ul><li><b>Subfolder:</b> The corrected images will be saved in a subfolder under the current album path.</li><li><b>Prefix:</b> A custom prefix will be added to the corrected image.</li><li><b>Suffix:</b> A custom suffix will be added to the corrected image.</li><li><b>Overwrite:</b> All original images will be replaced.</li></ul></p><p>Each of the three modes allows you to add an optional keyword to the image metadata.</p>
fr: <p>Ces réglages contrôlent le stockage des images corrigées. Il existe 3 modes à choisir : </p><p><ul><li><b>Sous-dossier : </b> Les images corrigées seront enregistrées dans un sous-dossier dans l'emplacement de l'album actuel.</li><li><b>Préfixe : </b> Un préfixe personnalisé sera ajouté à l'image corrigée.</li><li><b>Suffixe : </b> Un suffixe personnalisé sera ajouté à l'image corrigée.</li><li><b>Écrasement :</b> Toutes les images originales seront remplacées.</li></ul></p><p>Chacun de ces 2 modes vous permet d'ajouter un mot clé optionnel aux métadonnées de l'image.</p>

source: Save in Subfolder
fr: Enregistrer dans un sous-dossier

source: Add Prefix
fr: Ajouter un préfixe

source: Add Suffix
fr: Ajouter un suffixe

source: Overwrite
fr: Écraser

source: Enter the name of the subfolder, prefix or suffix to use for the corrected images.
fr: Saisir le nom du sous-dossier, le préfixe ou suffixe à utiliser pour les images corrigées.

source: Add &metadata keyword
fr: Ajouter un mot clé aux &métadonnées

source: If checked, a custom keyword will be applied to the image metadata.
fr: Si coché, un mot clé personnalisé sera appliqué aux métadonnées de l'images.

source: Enter the name of the custom keyword here...
fr: Saisir ici le nom du mot clé personnalisé...

source: Unprocessed Image Handling
fr: Gestion de l'image non traitée

source: <p>These settings control the handling of unprocessed images when running in test-mode. To speed up the final correction, unprocessed images can be removed from the list, so that they are not analyzed again. There are three modes to choose from:</p><p><ul><li><b>Ask the user:</b> A popup window will appear to ask for further actions.</li><li><b>Keep in file list:</b> All unprocessed images will be kept in the list.</li><li><b>Remove from file list:</b> All unprocessed images are removed after the test run.</li></ul></p>
fr: <p>Ces réglages contrôlent la gestion des images non traitées en mode de test. Pour accélérer la correction finale, les images non traitées peuvent être retirées de la liste, afin qu'elles ne soient pas de nouveau analysées. Il faut choisir l'un de ces trois modes :</p><p><ul><li><b>Demander à l'utilisateur : </b>Une fenêtre contextuelle apparaîtra pour demander les actions à effectuer.</li><li><b>Conserver dans la liste des fichiers : </b>Toutes les images non traitées seront conservées dans la liste.</li><li><b>Retirer de la liste des fichiers : </b>Toutes les images non traitées sont retirées après le test.</li></ul></p>

source: &Ask the user
fr: Dem&ander à l'utilisateur

source: If checked, the user will be asked to keep or remove unprocessed images.
fr: Si coché, il sera demandé à l'utilisateur de conserver ou de retirer les images non traitées.

source: &Keep in file list
fr: &Conserver dans la liste des fichiers

source: If checked, unprocessed images will be kept in the file list after the test-run.
fr: Si coché, les images non traitées seront conservées dans la liste des fichiers après le test.

source: &Remove from file list
fr: &Retirer de la liste des fichiers

source: If checked, unprocessed images will be removed from the file list after the test-run.
fr: Si coché, les images non traitées seront retirées de la liste des fichiers après le test.

# NAME OF TRANSLATORS
source: Your names
fr: Etienne Biardeaud

# EMAIL OF TRANSLATORS
source: Your emails
fr: etienne@cyteen.net
