Repository: KDE/kipi-plugins
Catalog: po/*/kipiplugin_jalbum.po
Languages: eo, zh_cn

source: Select Albums Location
eo: Elekti Lokon de Albumoj
zh_cn: 选择相册位置

source: Select jAlbum jar File Location
eo: Elekti Dosierlokon de jAlbum-jar
zh_cn: 选择 jAlbum jar 文件位置

source: OK
eo: Bone
zh_cn: 确定

source: Cancel
eo: Nuligi
zh_cn: 取消

source: Select jar File Location
eo: Elekti jar-Dosierlokon
zh_cn: 选择 jar 文件位置

source: Not a directory
eo: Ne dosierujo
zh_cn: 这不是一个目录

source: Chosen path is not a directory
eo: Elektita vojo ne estas dosierujo
zh_cn: 所选路径不属于目录

source: Missing directory
eo: Mankas dosierujo
zh_cn: 缺失目录

source: Directory %1 does not exist, do you wish to create it?
eo: Dosierujo %1 ne ekzistas, ĉu vi volas krei ĝin?
zh_cn: 目录 %1 不存在，您想新建此目录吗？

source: Failed to create directory
eo: Malsukcesis krei dosierujon
zh_cn: 无法创建目录

source: jAlbum Album name to export to:
eo: jAlbum Albumnomo por eksporti al:
zh_cn: 要导出的 jAlbum 相册名：

source: Settings
eo: Agordoj
zh_cn: 设置

source: jAlbum Export
eo: jAlbum-Eksporto
zh_cn: jAlbum 导出

source: A Kipi plugin to launch jAlbum using selected images.
eo: Kipi-aldonaĵo por lanĉi jAlbum uzante elektitajn bildojn.
zh_cn: 一个用所选图像启动 jAlbum 的 Kipi 插件。

source: Error
eo: Eraro
zh_cn: 错误

source: Overwrite?
eo: Ĉu anstataŭigi?
zh_cn: 覆盖?

source: Album %1 already exists, do you wish to overwrite it?
eo: Albumo %1 jam ekzistas, ĉu vi volas anstataŭigi ĝin?
zh_cn: 相册 %1 已存在，您想覆盖此相册吗？

source: Create dir Failed
eo: Krei diraĵon Malsukcesis
zh_cn: 目录创建失败

source: Failed to create album directory
eo: Malsukcesis krei albumdosierujon
zh_cn: 无法创建相册目录

source: Writing Failed
eo: Skribo Malsukcesis
zh_cn: 写入失败

source: Could not open 'albumfiles.txt' for writing
eo: Ne eblis malfermi 'albumfiles.txt' por skribado
zh_cn: 无法打开以写入“albumfiles.txt”

source: Could not open 'jalbum-settings.jap' for writing
eo: Ne eblis malfermi 'jalbum-settings.jap' por skribado
zh_cn: 无法打开以写入“jalbum-settings.jap”

source: Edit jAlbum Data
eo: Redakti jAlbum-Datumojn
zh_cn: 编辑 jAlbum 数据

source: &Export
eo: &Eksporti
zh_cn: 导出(&E)

source: Main Toolbar
eo: Ĉefa ilobreto
zh_cn: 主工具栏

source: Export to &jAlbum
eo: Eksporti al &jAlbumo
zh_cn: 导出至 &jAlbum
